{"[PAD]": 0, "[UNK]": 1, "[MASK]": 2, "[attraction_area]": 3, "[attraction_name]": 4, "[attraction_type]": 5, "[hotel_area]": 6, "[hotel_day]": 7, "[hotel_internet]": 8, "[hotel_name]": 9, "[hotel_parking]": 10, "[hotel_people]": 11, "[hotel_pricerange]": 12, "[hotel_stars]": 13, "[hotel_stay]": 14, "[hotel_type]": 15, "[restaurant_area]": 16, "[restaurant_day]": 17, "[restaurant_food]": 18, "[restaurant_name]": 19, "[restaurant_people]": 20, "[restaurant_pricerange]": 21, "[restaurant_time]": 22, "[taxi_arriveby]": 23, "[taxi_departure]": 24, "[taxi_destination]": 25, "[taxi_leaveat]": 26, "[train_arriveby]": 27, "[train_day]": 28, "[train_departure]": 29, "[train_destination]": 30, "[train_leaveat]": 31, "[train_people]": 32, "none": 33, ".": 34, "i": 35, "[USER]": 36, "the": 37, "?": 38, "you": 39, "[SYSTEM]": 40, ",": 41, "a": 42, "to": 43, "for": 44, "is": 45, "in": 46, "and": 47, "would": 48, "that": 49, "like": 50, "can": 51, "there": 52, "have": 53, "of": 54, "are": 55, "need": 56, "am": 57, "me": 58, "it": 59, "on": 60, "at": 61, "do": 62, "number": 63, "restaurant": 64, "please": 65, "yes": 66, "book": 67, "looking": 68, "what": 69, "be": 70, "with": 71, "your": 72, "hotel": 73, "-s": 74, "cambridge": 75, "help": 76, "train": 77, "town": 78, "will": 79, "price": 80, "place": 81, "free": 82, "area": 83, "from": 84, "not": 85, "1": 86, "centre": 87, "range": 88, "also": 89, "no": 90, "reference": 91, "s": 92, "food": 93, "any": 94, "!": 95, "anything": 96, "time": 97, "find": 98, "else": 99, "people": 100, "phone": 101, "stay": 102, "about": 103, "or": 104, "by": 105, "how": 106, "star": 107, "want": 108, "hotel-name": 109, "guesthouse": 110, "4": 111, "moderate": 112, "address": 113, "restaurant-food": 114, "thank": 115, "expensive": 116, "restaurant-name": 117, "train-destination": 118, "postcode": 119, "get": 120, "located": 121, "an": 122, "train-departure": 123, "leave": 124, "great": 125, "type": 126, "day": 127, "could": 128, "sure": 129, "2": 130, "booking": 131, "information": 132, "all": 133, "arrive": 134, "but": 135, "cheap": 136, "was": 137, "go": 138, "nights": 139, "north": 140, "we": 141, "table": 142, "restaurant-area": 143, "restaurant-pricerange": 144, "parking": 145, "reservation": 146, "as": 147, "leaving": 148, "their": 149, "does": 150, "try": 151, "priced": 152, "3": 153, "attraction-name": 154, "if": 155, "where": 156, "should": 157, "after": 158, "sorry": 159, "thanks": 160, "many": 161, "-ly": 162, "just": 163, "recommend": 164, "attraction-type": 165, "part": 166, "has": 167, "train-day": 168, "prefer": 169, "okay": 170, "they": 171, "hotel-type": 172, "east": 173, "west": 174, "fee": 175, "some": 176, "hotel-area": 177, "hotel-stars": 178, "today": 179, "house": 180, "something": 181, "this": 182, "city": 183, "hotel-pricerange": 184, "5": 185, "available": 186, "give": 187, "preference": 188, "booked": 189, "leaves": 190, "south": 191, "make": 192, "taxi": 193, "starting": 194, "street": 195, "which": 196, "departing": 197, "attraction-area": 198, "entrance": 199, "travel": 200, "going": 201, "serves": 202, "different": 203, "trains": 204, "wifi": 205, "attraction": 206, "stars": 207, "more": 208, "options": 209, "good": 210, "hotel-parking": 211, "hotel-internet": 212, "tell": 213, "know": 214, "restaurant-bookpeople": 215, "sounds": 216, "room": 217, "road": 218, "same": 219, "hotel-bookpeople": 220, "another": 221, "so": 222, "side": 223, "restaurant-bookday": 224, "my": 225, "successful": 226, "particular": 227, "ok": 228, "restaurant-booktime": 229, "criteria": 230, "arrives": 231, "rating": 232, "hotel-bookstay": 233, "i'll": 234, "hi": 235, "hotel-bookday": 236, "called": 237, "museum": 238, "work": 239, "guesthouses": 240, "interested": 241, "indian": 242, "friday": 243, ":": 244, "may": 245, "well": 246, "sunday": 247, "college": 248, "center": 249, "tickets": 250, "visit": 251, "other": 252, "minutes": 253, "chinese": 254, "mind": 255, "saturday": 256, "internet": 257, "them": 258, "dontcare": 259, "tuesday": 260, "train-leaveat": 261, "attractions": 262, "thursday": 263, "train-arriveby": 264, "wednesday": 265, "really": 266, "those": 267, "monday": 268, "much": 269, "station": 270, "departure": 271, "arriving": 272, "specific": 273, "fine": 274, "several": 275, "include": 276, "depart": 277, "actually": 278, "guest": 279, "traveling": 280, "hello": 281, "cuisine": 282, "destination": 283, "eat": 284, "ticket": 285, "pounds": 286, "matter": 287, "italian": 288, "found": 289, "location": 290, "let": 291, "when": 292, "train-bookpeople": 293, "look": 294, "needs": 295, "contact": 296, "trip": 297, "6": 298, "dine": 299, "now": 300, "up": 301, "both": 302, "suggest": 303, "did": 304, "check": 305, "breakfast": 306, "7": 307, "museums": 308, "bed": 309, "able": 310, "take": 311, "provide": 312, "care": 313, "total": 314, "15": 315, "nice": 316, "certain": 317, "assist": 318, "8": 319, "see": 320, "park": 321, "british": 322, "then": 323, "unfortunately": 324, "serve": 325, "reserved": 326, "code": 327, "instead": 328, "arrival": 329, "staying": 330, "meet": 331, "down": 332, "taxi-destination": 333, "narrow": 334, "choose": 335, "too": 336, "taxi-departure": 337, "long": 338, "think": 339, "kings": 340, "gbp": 341, "first": 342, "out": 343, "very": 344, "european": 345, "london": 346, "reserve": 347, "search": 348, "id": 349, "entertainment": 350, "either": 351, "info": 352, "offer": 353, "colleges": 354, "lodge": 355, "finding": 356, "perfect": 357, "goodbye": 358, "planning": 359, "post": 360, "only": 361, "acorn": 362, "pick": 363, "departs": 364, "payable": 365, "kind": 366, "happy": 367, "needed": 368, "fit": 369, "hospital": 370, "certainly": 371, "saint": 372, "bar": 373, "ely": 374, "night": 375, "few": 376, "leicester": 377, "person": 378, "preferences": 379, "car": 380, "cost": 381, "match": 382, "between": 383, "norwich": 384, "were": 385, "serving": 386, "peterborough": 387, "chesterton": 388, "been": 389, "broxbourne": 390, "request": 391, "perhaps": 392, "right": 393, "course": 394, "shall": 395, "name": 396, "here": 397, "0": 398, "these": 399, "oh": 400, "stevenage": 401, "us": 402, "though": 403, "near": 404, "maybe": 405, "possible": 406, "cherry": 407, "matching": 408, "architecture": 409, "hinton": 410, "before": 411, "9": 412, "somewhere": 413, "requirement": 414, "its": 415, "way": 416, "days": 417, "reservations": 418, "gonville": 419, "pool": 420, "choices": 421, "university": 422, "set": 423, "while": 424, "thing": 425, "milton": 426, "theatre": 427, "admission": 428, "10": 429, "got": 430, "church": 431, "gallery": 432, "results": 433, "quite": 434, "offers": 435, "party": 436, "alexander": 437, "hour": 438, "king": 439, "lane": 440, "sound": 441, "love": 442, "cross": 443, "best": 444, "pizza": 445, "absolutely": 446, "local": 447, "meets": 448, "11": 449, "alright": 450, "ashley": 451, "liverpool": 452, "new": 453, "again": 454, "further": 455, "asian": 456, "matches": 457, "arms": 458, "cannot": 459, "rated": 460, "favorite": 461, "call": 462, "fun": 463, "coming": 464, "might": 465, "still": 466, "into": 467, "allenbell": 468, "trying": 469, "regent": 470, "heading": 471, "boat": 472, "parkside": 473, "airport": 474, "police": 475, "cinema": 476, "curry": 477, "welcome": 478, "little": 479, "lynn": 480, "taxi-leaveat": 481, "modern": 482, "bishops": 483, "sports": 484, "fen": 485, "made": 486, "lensfield": 487, "listed": 488, "wanting": 489, "nothing": 490, "later": 491, "lot": 492, "definitely": 493, "send": 494, "huntingdon": 495, "everything": 496, "yeah": 497, "around": 498, "suggestions": 499, "choice": 500, "swimming": 501, "hoping": 502, "our": 503, "unable": 504, "birmingham": 505, "every": 506, "el": 507, "stansted": 508, "problem": 509, "wonderful": 510, "change": 511, "shaddai": 512, "cityroomz": 513, "seat": 514, "bridge": 515, "express": 516, "assistance": 517, "stortford": 518, "21": 519, "la": 520, "needing": 521, "pools": 522, "yet": 523, "belfry": 524, "nightclub": 525, "hills": 526, "preferred": 527, "recommendation": 528, "b": 529, "33": 530, "most": 531, "over": 532, "option": 533, "ditton": 534, "oriental": 535, "portuguese": 536, "multiple": 537, "addenbrookes": 538, "marriott": 539, "close": 540, "nightclubs": 541, "than": 542, "fits": 543, "interesting": 544, "13": 545, "things": 546, "visiting": 547, "gastropub": 548, "ahead": 549, "closest": 550, "trinity": 551, "noodle": 552, "christ": 553, "african": 554, "parks": 555, "excellent": 556, "seats": 557, "open": 558, "ask": 559, "art": 560, "per": 561, "13:00": 562, "such": 563, "unsuccessful": 564, "looks": 565, "start": 566, "17": 567, "international": 568, "venue": 569, "end": 570, "london liverpool street": 571, "acorn guest house": 572, "shorter": 573, "earliest": 574, "preferably": 575, "17:00": 576, "rosa": 577, "turkish": 578, "rooms": 579, "kings lynn": 580, "interest": 581, "travelling": 582, "stansted airport": 583, "clifton": 584, "goes": 585, "apologize": 586, "telephone": 587, "14": 588, "17:45": 589, "bistro": 590, "hall": 591, "lovell": 592, "12:15": 593, "12:30": 594, "london kings cross": 595, "taxi-arriveby": 596, "birmingham new street": 597, "11:00": 598, "bishops stortford": 599, "postal": 600, "hut": 601, "leisure": 602, "earlier": 603, "suit": 604, "golden": 605, "23": 606, "14:45": 607, "myself": 608, "group": 609, "rd": 610, "12:00": 611, "description": 612, "19": 613, "confirm": 614, "11:45": 615, "spanish": 616, "ones": 617, "costs": 618, "16:45": 619, "garden": 620, "works": 621, "department": 622, "back": 623, "12": 624, "system": 625, "12:45": 626, "times": 627, "avalon": 628, "19:30": 629, "enjoy": 630, "headed": 631, "11:30": 632, "mediterranean": 633, "15:15": 634, "is:": 635, "ride": 636, "newmarket": 637, "thai": 638, "commute": 639, "french": 640, "dining": 641, "better": 642, "16:00": 643, "afraid": 644, "holiday": 645, "club": 646, "jesus": 647, "cafe": 648, "types": 649, "15:00": 650, "13:45": 651, "tandoori": 652, "18:15": 653, "wanted": 654, "showing": 655, "15:45": 656, "11:15": 657, "15:30": 658, "site": 659, "date": 660, "lots": 661, "show": 662, "hospital-department": 663, "16:30": 664, "vietnamese": 665, "mexican": 666, "mill": 667, "beginning": 668, "green": 669, "inn": 670, "16:15": 671, "bedouin": 672, "17:30": 673, "list": 674, "bye": 675, "14:30": 676, "country": 677, "locate": 678, "aylesbray": 679, "worth": 680, "magdalene": 681, "17:15": 682, "nearby": 683, "warkworth": 684, "however": 685, "lets": 686, "heard": 687, "14:00": 688, "nandos": 689, "guess": 690, "picked": 691, "im": 692, "castle": 693, "next": 694, "autumn": 695, "18:30": 696, "popular": 697, "inexpensive": 698, "wait": 699, "listings": 700, "meeting": 701, "13:30": 702, "lovely": 703, "18:00": 704, "enter": 705, "guests": 706, "19:00": 707, "high": 708, "13:15": 709, "bit": 710, "lodging": 711, "fees": 712, "20:00": 713, "theatres": 714, "hamilton": 715, "parade": 716, "79": 717, "saints": 718, "mary": 719, "arbury": 720, "correct": 721, "downing": 722, "use": 723, "plenty": 724, "21:00": 725, "specification": 726, "44": 727, "confirmation": 728, "recommendations": 729, "royal": 730, "entries": 731, "alexander bed and breakfast": 732, "houses": 733, "successfully": 734, "important": 735, "18": 736, "availability": 737, "broughton": 738, "154": 739, "schedule": 740, "-er": 741, "least": 742, "details": 743, "rather": 744, "hmm": 745, "we'll": 746, "american": 747, "point": 748, "19:15": 749, "sometime": 750, "21:15": 751, "finches": 752, "old": 753, "boating": 754, "andrew": 755, "accommodations": 756, "named": 757, "18:45": 758, "tourist": 759, "questions": 760, "artworks": 761, "01223358966": 762, "morning": 763, "wish": 764, "10:30": 765, "clare": 766, "must": 767, "early": 768, "prince": 769, "wondering": 770, "additional": 771, "yard": 772, "hobsons": 773, "14:15": 774, "st": 775, "had": 776, "20:15": 777, "pay": 778, "10.10": 779, "thinking": 780, "awesome": 781, "korean": 782, "hey": 783, "once": 784, "churchill": 785, "cb20qq": 786, "others": 787, "appreciate": 788, "completed": 789, "rice": 790, "home": 791, "swimming pool": 792, "#": 793, "night club": 794, "graffiti": 795, "09:15": 796, "anatolia": 797, "duration": 798, "sort": 799, "pizzeria": 800, "boats": 801, "seems": 802, "moment": 803, "nusha": 804, "21:30": 805, "said": 806, "chop": 807, "&": 808, "excited": 809, "hold": 810, "off": 811, "nope": 812, "listing": 813, "alpha": 814, "whatever": 815, "10:15": 816, "concerthall": 817, "someplace": 818, "ready": 819, "say": 820, "churches": 821, "accommodate": 822, "archway": 823, "unit": 824, "getting": 825, "amenities": 826, "come": 827, "adc": 828, "chan": 829, "camboats": 830, "gets": 831, "cb17dy": 832, "kohinoor": 833, "tenpin": 834, "pricing": 835, "last": 836, "charlie": 837, "passage": 838, "wok": 839, "leverton": 840, "suggestion": 841, "require": 842, "24": 843, "white": 844, "thats": 845, "within": 846, "you've": 847, "mentioned": 848, "business": 849, "luck": 850, "22": 851, "kettle": 852, "helpful": 853, "21:45": 854, "week": 855, "including": 856, "forward": 857, "each": 858, "hakka": 859, "cb41da": 860, "market": 861, "nearest": 862, "10:45": 863, "19:45": 864, "anytime": 865, "service": 866, "done": 867, "included": 868, "black": 869, "jello": 870, "yellow": 871, "10:00": 872, "happen": 873, "20:45": 874, "red": 875, "seeing": 876, "plan": 877, "grey": 878, "school": 879, "vue": 880, "carolina": 881, "reach": 882, "asian oriental": 883, "gardens": 884, "whether": 885, "slot": 886, "seem": 887, "wandlebury": 888, "route": 889, "barnabas": 890, "specifically": 891, "galleries": 892, "style": 893, "kitchen": 894, "brasserie": 895, "08:15": 896, "hear": 897, "tonight": 898, "checking": 899, "concert": 900, "numbers": 901, "complete": 902, "grafton": 903, "blue": 904, "during": 905, "dojo": 906, "dinner": 907, "schools": 908, "county": 909, "kymmoy": 910, "cb11jg": 911, "andrews": 912, "09:45": 913, "09:30": 914, "using": 915, "far": 916, "08:30": 917, "soon": 918, "possibly": 919, "tree": 920, "51": 921, "necessary": 922, "ashley hotel": 923, "spice": 924, "nirala": 925, "fantastic": 926, "riverboat": 927, "consider": 928, "dont": 929, "cool": 930, "latest": 931, "soul": 932, "lebanese": 933, "entry": 934, "oak": 935, "yippee": 936, "pm": 937, "meghna": 938, "georgina": 939, "minute": 940, "university arms hotel": 941, "20": 942, "newnham": 943, "primavera": 944, "told": 945, "modern european": 946, "01223245151": 947, "da": 948, "highly": 949, "galleria": 950, "ballare": 951, "vinci": 952, "08:45": 953, "japanese": 954, "prezzo": 955, "funky": 956, "histon": 957, "lucky": 958, "already": 959, "88": 960, "eraina": 961, "fitting": 962, "evening": 963, "cambridge belfry": 964, "gonville hotel": 965, "seafood": 966, "salsa": 967, "run": 968, "specify": 969, "requests": 970, "rest": 971, "cinemas": 972, "fi": 973, "number:": 974, "de": 975, "reached": 976, "pretty": 977, "charge": 978, "20:30": 979, "theater": 980, "offering": 981, "glad": 982, "since": 983, "willing": 984, "money": 985, "98": 986, "01223353888": 987, "we're": 988, "zero": 989, "wi": 990, "forgot": 991, "varsity": 992, "bloomsbury": 993, "binh": 994, "archaeology": 995, "08:00": 996, "alimentum": 997, "northern": 998, "holy": 999, "cb23bu": 1000, "without": 1001, "thanh": 1002, "confusion": 1003, "hedges": 1004, "man": 1005, "picky": 1006, "arts": 1007, "victoria": 1008, "exactly": 1009, "09:00": 1010, "requested": 1011, "case": 1012, "byard": 1013, "technology": 1014, "mood": 1015, "exchange": 1016, "austrian": 1017, "palace": 1018, "error": 1019, "8:30": 1020, "variety": 1021, "folk": 1022, "cineworld": 1023, "cb11ln": 1024, "express by holiday inn cambridge": 1025, "play": 1026, "163": 1027, "corn": 1028, "full": 1029, "cote": 1030, "ugly": 1031, "abbey": 1032, "mumford": 1033, "access": 1034, "hill": 1035, "couple": 1036, "budget": 1037, "clarify": 1038, "ranging": 1039, "why": 1040, "beautiful": 1041, "fitzbillies": 1042, "raza": 1043, "anthropology": 1044, "botanic": 1045, "uno": 1046, "johns": 1047, "56": 1048, "trumpington": 1049, "running": 1050, "margherita": 1051, "28": 1052, "duckling": 1053, "rajmahal": 1054, "whichever": 1055, "chiquito": 1056, "outdoor": 1057, "honda": 1058, "jinling": 1059, "shiraz": 1060, "bangkok": 1061, "49": 1062, "believe": 1063, "section": 1064, "until": 1065, "greens": 1066, "01223446100": 1067, "second": 1068, "16.60": 1069, "regarding": 1070, "searching": 1071, "huntingdon marriott hotel": 1072, "we'd": 1073, "16": 1074, "that'll": 1075, "christ college": 1076, "lexus": 1077, "tesla": 1078, "23.60": 1079, "surprise": 1080, "limehouse": 1081, "skoda": 1082, "gandhi": 1083, "peking": 1084, "village": 1085, "9:15": 1086, "order": 1087, "29": 1088, "mimosa": 1089, "100": 1090, "riverside": 1091, "afternoon": 1092, "making": 1093, "yu": 1094, "missing": 1095, "keep": 1096, "interests": 1097, "luca": 1098, "moon": 1099, "hope": 1100, "toyota": 1101, "recommended": 1102, "9:30": 1103, "jamaican": 1104, "contemporary": 1105, "architectural": 1106, "idea": 1107, "helping": 1108, "cotto": 1109, "upcoming": 1110, "cb11ly": 1111, "head": 1112, "river": 1113, "fusion": 1114, "indeed": 1115, "picking": 1116, "38": 1117, "efes": 1118, "takes": 1119, "70": 1120, "hamilton lodge": 1121, "gardenia": 1122, "lodgings": 1123, "cocum": 1124, "length": 1125, "cucina": 1126, "2.50": 1127, "tasca": 1128, "17.90": 1129, "el shaddia guesthouse": 1130, "zizzi": 1131, "50": 1132, "mean": 1133, "being": 1134, "sidney": 1135, "portugese": 1136, "sock": 1137, "injured": 1138, "records": 1139, "ford": 1140, "unavailable": 1141, "double": 1142, "history": 1143, "hobsons house": 1144, "01223334900": 1145, "category": 1146, "catch": 1147, "he": 1148, "christi": 1149, "whale": 1150, "accident": 1151, "having": 1152, "lensfield hotel": 1153, "takeaway": 1154, "currently": 1155, "10:07": 1156, "begin": 1157, "stazione": 1158, "corpus": 1159, "bmw": 1160, "confirmed": 1161, "a and b guest house": 1162, "75.10": 1163, "emmanuel": 1164, "swimmingpool": 1165, "water": 1166, "9:45": 1167, "01223314960": 1168, "restate": 1169, "thought": 1170, "seoul": 1171, "all saints church": 1172, "105": 1173, "apologies": 1174, "j": 1175, "never": 1176, "32": 1177, "saigon": 1178, "directions": 1179, "aylesbray lodge guest house": 1180, "18:07": 1181, "punter": 1182, "05:00": 1183, "malaysian": 1184, "gilbert": 1185, "9:00": 1186, "202": 1187, "vegetarian": 1188, "sleeperz": 1189, "meant": 1190, "4.40": 1191, "science": 1192, "cb58bs": 1193, "cb21sj": 1194, "47": 1195, "friend": 1196, "bridge guest house": 1197, "frankie": 1198, "82": 1199, "exact": 1200, "verify": 1201, "issue": 1202, "appears": 1203, "74": 1204, "fact": 1205, "astroturf": 1206, "shop": 1207, "fyne": 1208, "kirkwood": 1209, "audi": 1210, "finches bed and breakfast": 1211, "standard": 1212, "family": 1213, "ref": 1214, "reviews": 1215, "through": 1216, "pitch": 1217, "pound": 1218, "autumn house": 1219, "01223452587": 1220, "establishment": 1221, "acceptable": 1222, "amount": 1223, "chose": 1224, "theaters": 1225, "flexible": 1226, "12:07": 1227, "spot": 1228, "fez": 1229, "german": 1230, "17.60": 1231, "60": 1232, "52": 1233, "rosas bed and breakfast": 1234, "taking": 1235, "learner": 1236, "norfolk": 1237, "volkswagen": 1238, "midsummer": 1239, "kambar": 1240, "even": 1241, "coldham": 1242, "addresses": 1243, "steakhouse": 1244, "12.80": 1245, "backstreet": 1246, "danish": 1247, "upscale": 1248, "desired": 1249, "it'll": 1250, "dates": 1251, "eating": 1252, "133": 1253, "robbed": 1254, "avenue": 1255, "held": 1256, "c": 1257, "spend": 1258, "30": 1259, "8:45": 1260, "mid": 1261, "almost": 1262, "loch": 1263, "two": 1264, "tables": 1265, "arrange": 1266, "because": 1267, "swiss": 1268, "always": 1269, "stations": 1270, "haven't": 1271, "37.80": 1272, "cuban": 1273, "enough": 1274, "hotpot": 1275, "broughton house gallery": 1276, "warkworth house": 1277, "wine": 1278, "checked": 1279, "gourmet": 1280, "wagamama": 1281, "cookhouse": 1282, "junction": 1283, "general": 1284, "volvo": 1285, "passenger": 1286, "burger": 1287, "archway house": 1288, "stop": 1289, "jubilee": 1290, "punting": 1291, "unusual": 1292, "purchase": 1293, "causeway": 1294, "select": 1295, "arbury lodge guesthouse": 1296, "cow": 1297, "bennys": 1298, "adress": 1299, "bill": 1300, "curry garden": 1301, "storey": 1302, "worth house": 1303, "taj": 1304, "copper": 1305, "huntington": 1306, "cb13ef": 1307, "m": 1308, "special": 1309, "late": 1310, "cb43ax": 1311, "john": 1312, "ruskin": 1313, "cab": 1314, "sheep": 1315, "coffee": 1316, "particularly": 1317, "westside": 1318, "curry prince": 1319, "panahar": 1320, "queens": 1321, "land": 1322, "narrows": 1323, "row": 1324, "caffe": 1325, "8:00": 1326, "8.08": 1327, "craving": 1328, "517a": 1329, "amazing": 1330, "shorten": 1331, "database": 1332, "russian": 1333, "eastern": 1334, "fare": 1335, "greek": 1336, "16:07": 1337, "cb30aq": 1338, "scudamores": 1339, "bateman": 1340, "caribbean": 1341, "sala": 1342, "suppose": 1343, "cb58as": 1344, "etc": 1345, "mahal": 1346, "byard art": 1347, "personally": 1348, "less": 1349, "cb30af": 1350, "13:17": 1351, "mention": 1352, "frame": 1353, "asked": 1354, "20:07": 1355, "classical": 1356, "archaelogy": 1357, "mercers": 1358, "indonesian": 1359, "tang": 1360, "trainid": 1361, "downtown": 1362, "cruisers": 1363, "object": 1364, "stick": 1365, "carolina bed and breakfast": 1366, "meze": 1367, "suitable": 1368, "activity": 1369, "chance": 1370, "fancy": 1371, "travellers": 1372, "thong": 1373, "along": 1374, "wow": 1375, "alpha milton guest house": 1376, "whipple": 1377, "news": 1378, "city centre north bed and breakfast": 1379, "16.50": 1380, "christmas": 1381, "alone": 1382, "su43": 1383, "arcade": 1384, "halls": 1385, "cheapest": 1386, "put": 1387, "query": 1388, "concerned": 1389, "crossover": 1390, "based": 1391, "darrys": 1392, "cb21dq": 1393, "pipasha": 1394, "9.80": 1395, "transportation": 1396, "whitehill": 1397, "persian": 1398, "broaden": 1399, "17:29": 1400, "australian": 1401, "ideas": 1402, "under": 1403, "35": 1404, "names": 1405, "considered": 1406, "golden wok": 1407, "grounds": 1408, "ali": 1409, "irish": 1410, "cambourne": 1411, "closer": 1412, "um": 1413, "ill": 1414, "01223464646": 1415, "wife": 1416, "05:40": 1417, "sri": 1418, "saffron": 1419, "01223525725": 1420, "cb18dw": 1421, "lammas": 1422, "actual": 1423, "strover": 1424, "ah": 1425, "8:15": 1426, "neither": 1427, "rose": 1428, "lynne": 1429, "baba": 1430, "kosher": 1431, "venetian": 1432, "multiple sports": 1433, "polish": 1434, "5357": 1435, "specifics": 1436, "affordable": 1437, "hungarian": 1438, "69": 1439, "grande": 1440, "01223210353": 1441, "da vinci pizzeria": 1442, "milton country park": 1443, "08712240240": 1444, "someone": 1445, "tuscan": 1446, "sitar": 1447, "pricey": 1448, "departures": 1449, "du": 1450, "vin": 1451, "don": 1452, "moroccan": 1453, "14:07": 1454, "possibilities": 1455, "mistake": 1456, "31": 1457, "11:29": 1458, "mutliple": 1459, "comes": 1460, "catalan": 1461, "pizza hut fenditton": 1462, "3.50": 1463, "ever": 1464, "scottish": 1465, "lankan": 1466, "01223474144": 1467, "vue cinema": 1468, "success": 1469, "01223902091": 1470, "wide": 1471, "11:21": 1472, "confused": 1473, "53": 1474, "swedish": 1475, "191": 1476, "hobson": 1477, "co": 1478, "ideally": 1479, "queen": 1480, "maharajah": 1481, "63": 1482, "doing": 1483, "18.88": 1484, "cb12lf": 1485, "10:32": 1486, "cb21ab": 1487, "quality": 1488, "roseford": 1489, "05:17": 1490, "dojo noodle bar": 1491, "cambridge artworks": 1492, "cb13js": 1493, "staring": 1494, "cb46az": 1495, "15:21": 1496, "throughout": 1497, "01223902168": 1498, "southern": 1499, "trouble": 1500, "cantonese": 1501, "thanh binh": 1502, "64": 1503, "hungry": 1504, "01223334860": 1505, "bet": 1506, "understand": 1507, "feel": 1508, "girton": 1509, "dispute": 1510, "changed": 1511, "postcodes": 1512, "anglia": 1513, "anymore": 1514, "plough": 1515, "antiques": 1516, "01223304050": 1517, "bad": 1518, "sites": 1519, "old schools": 1520, "riverboat georgina": 1521, "yippee noodle bar": 1522, "13:29": 1523, "cb30ds": 1524, "10:01": 1525, "wouldn't": 1526, "106": 1527, "17:21": 1528, "23:00": 1529, "services": 1530, "bangkok city": 1531, "americas": 1532, "14:08": 1533, "sir": 1534, "pasquale": 1535, "charlie chan": 1536, "appear": 1537, "01223332320": 1538, "due": 1539, "cb12de": 1540, "5:52": 1541, "similar": 1542, "wheeler": 1543, "fall": 1544, "press": 1545, "latin": 1546, "lovell lodge": 1547, "124": 1548, "05:29": 1549, "01223366611": 1550, "kingfisher": 1551, "kinds": 1552, "probably": 1553, "16:08": 1554, "gastropubs": 1555, "the man on the moon": 1556, "royal spice": 1557, "cb21dp": 1558, "cb11ps": 1559, "journey": 1560, "parts": 1561, "familiar": 1562, "01223902088": 1563, "leverton house": 1564, "parkside pools": 1565, "eritrean": 1566, "fitzwilliam": 1567, "1517": 1568, "norman": 1569, "friends": 1570, "buy": 1571, "05:11": 1572, "schedules": 1573, "lunch": 1574, "churchills college": 1575, "india": 1576, "yu garden": 1577, "01223304705": 1578, "30.24": 1579, "herschel": 1580, "13:35": 1581, "hinchinbrook": 1582, "personal": 1583, "accommodation": 1584, "foods": 1585, "mowbray": 1586, "polynesian": 1587, "hong": 1588, "cafe jello gallery": 1589, "01223420060": 1590, "working": 1591, "404": 1592, "driver": 1593, "15:29": 1594, "middle": 1595, "corsica": 1596, "cb236bw": 1597, "01223336233": 1598, "01223312112": 1599, "01223902112": 1600, "68": 1601, "creative": 1602, "howdy": 1603, "2124": 1604, "05:21": 1605, "slug": 1606, "lettuce": 1607, "hk": 1608, "coldhams": 1609, "tour": 1610, "catharine": 1611, "weekend": 1612, "nah": 1613, "08715501010": 1614, "figure": 1615, "sesame": 1616, "deal": 1617, "yo": 1618, "narrowed": 1619, "plans": 1620, "cambridge university botanic gardens": 1621, "caius": 1622, "traditional": 1623, "relatively": 1624, "01223300085": 1625, "activities": 1626, "calling": 1627, "marriot": 1628, "convenient": 1629, "the oak bistro": 1630, "home from home": 1631, "asking": 1632, "worry": 1633, "went": 1634, "northampton": 1635, "11:17": 1636, "01223355397": 1637, "hourly": 1638, "156": 1639, "afghan": 1640, "ideal": 1641, "cuisines": 1642, "club salsa": 1643, "castle galleries": 1644, "downing college": 1645, "whale of a time": 1646, "greetings": 1647, "cb23dz": 1648, "12:08": 1649, "extra": 1650, "cb223ae": 1651, "exhibition": 1652, "scandinavian": 1653, "north american": 1654, "little seoul": 1655, "granta": 1656, "provides": 1657, "cb23qf": 1658, "01223902158": 1659, "clowns": 1660, "710": 1661, "given": 1662, "10.24": 1663, "451": 1664, "01954781018": 1665, "kindly": 1666, "01223866800": 1667, "centrally": 1668, "bus": 1669, "ugly duckling": 1670, "p": 1671, "related": 1672, "wrong": 1673, "19:35": 1674, "super": 1675, "15:17": 1676, "pleasure": 1677, "grill": 1678, "kirkwood house": 1679, "96": 1680, "barton": 1681, "english": 1682, "anyway": 1683, "meal": 1684, "13:39": 1685, "01223357708": 1686, "viking": 1687, "crescent": 1688, "110": 1689, "5:40": 1690, "5:00": 1691, "01223576412": 1692, "swim": 1693, "la margherita": 1694, "holy trinity church": 1695, "kid": 1696, "starts": 1697, "remember": 1698, "01223333516": 1699, "quick": 1700, "15:52": 1701, "13:11": 1702, "across": 1703, "lion": 1704, "fails": 1705, "13:59": 1706, "cb12tz": 1707, "17:11": 1708, "the gardenia": 1709, "frankie and bennys": 1710, "00872208000": 1711, "cb21tt": 1712, "forget": 1713, "pembroke": 1714, "halal": 1715, "enterprise": 1716, "11:01": 1717, "tenison": 1718, "welsh": 1719, "40428": 1720, "explore": 1721, "17:06": 1722, "83": 1723, "silver": 1724, "riverside brasserie": 1725, "tandoori palace": 1726, "11:06": 1727, "22:01": 1728, "williams": 1729, "perfectly": 1730, "13.20": 1731, "ring": 1732, "worked": 1733, "direct": 1734, "62": 1735, "cb17gx": 1736, "11:35": 1737, "13.28": 1738, "elsewhere": 1739, "01223307402": 1740, "11:52": 1741, "tried": 1742, "21:01": 1743, "05:19": 1744, "paid": 1745, "attending": 1746, "05:54": 1747, "cb21ad": 1748, "01223350914": 1749, "finders": 1750, "corner": 1751, "37": 1752, "tr": 1753, "19:21": 1754, "australasian": 1755, "portraits": 1756, "cineworld cinema": 1757, "saigon city": 1758, "41": 1759, "14.08": 1760, "concern": 1761, "main": 1762, "cb58sx": 1763, "cb12bd": 1764, "57": 1765, "05:01": 1766, "19:29": 1767, "known": 1768, "peas": 1769, "08451962320": 1770, "adc theatre": 1771, "la raza": 1772, "09:29": 1773, "unknown": 1774, "gave": 1775, "11:32": 1776, "millers": 1777, "felix": 1778, "whitehouse": 1779, "17:50": 1780, "5:30": 1781, "18:40": 1782, "taken": 1783, "11:51": 1784, "choosing": 1785, "expecting": 1786, "square": 1787, "period": 1788, "edward": 1789, "01223365664": 1790, "01223336265": 1791, "17:59": 1792, "heidelberg": 1793, "5:11": 1794, "bites": 1795, "funky fun house": 1796, "fitzbillies restaurant": 1797, "travellers rest": 1798, "towninfo": 1799, "example": 1800, "sidgwick": 1801, "experience": 1802, "unsure": 1803, "belgian": 1804, "36": 1805, "preferable": 1806, "10.1": 1807, "01223337766": 1808, "worried": 1809, "museum of archaelogy and anthropology": 1810, "bloomsbury restaurant": 1811, "pizza express": 1812, "abbey pool and astroturf pitch": 1813, "year": 1814, "7.84": 1815, "although": 1816, "sleep": 1817, "delicious": 1818, "provided": 1819, "noon": 1820, "question": 1821, "11:54": 1822, "met": 1823, "01223575314": 1824, "cb23nz": 1825, "bummer": 1826, "concerthalls": 1827, "23:29": 1828, "doesnt": 1829, "establishments": 1830, "wandlebury country park": 1831, "01223323737": 1832, "central": 1833, "company": 1834, "144": 1835, "cb41er": 1836, "06:07": 1837, "own": 1838, "10:43": 1839, "cb39et": 1840, "estate": 1841, "01223566388": 1842, "reserving": 1843, "giving": 1844, "specified": 1845, "various": 1846, "138": 1847, "husband": 1848, "selection": 1849, "gives": 1850, "13:40": 1851, "shanghai": 1852, "alternative": 1853, "7880": 1854, "jinling noodle bar": 1855, "restuarant": 1856, "terrace": 1857, "opening": 1858, "features": 1859, "court": 1860, "205": 1861, "cb23pj": 1862, "hopefully": 1863, "colville": 1864, "11:59": 1865, "arrangements": 1866, "light": 1867, "13:01": 1868, "15:11": 1869, "23:30": 1870, "gourmet burger kitchen": 1871, "chiquito restaurant bar": 1872, "cambridge and county folk museum": 1873, "saffron brasserie": 1874, "01223332360": 1875, "bookings": 1876, "5:21": 1877, "d": 1878, "whats": 1879, "western": 1880, "9:52": 1881, "addition": 1882, "10:40": 1883, "trips": 1884, "especially": 1885, "200": 1886, "09:32": 1887, "parameters": 1888, "they'll": 1889, "past": 1890, "01223327908": 1891, "appointment": 1892, "108": 1893, "01223446104": 1894, "pe296fl": 1895, "2g": 1896, "01223324600": 1897, "16:40": 1898, "15:07": 1899, "14:01": 1900, "cb21rh": 1901, "homerton": 1902, "15:27": 1903, "18:01": 1904, "40": 1905, "365": 1906, "corpus christi": 1907, "soul tree nightclub": 1908, "seeking": 1909, "reasonable": 1910, "locating": 1911, "hmmm": 1912, "01223350688": 1913, "perne": 1914, "15:39": 1915, "01954714600": 1916, "cancel": 1917, "grafton hotel restaurant": 1918, "cambridge contemporary art": 1919, "328a": 1920, "hughes": 1921, "tr9448": 1922, "151": 1923, "molecular": 1924, "gastronomy": 1925, "expand": 1926, "cb12jb": 1927, "space": 1928, "13:21": 1929, "21:29": 1930, "top": 1931, "depending": 1932, "13:52": 1933, "60.08": 1934, "public": 1935, "clare hall": 1936, "la tasca": 1937, "michaelhouse": 1938, "lan": 1939, "contacting": 1940, "stated": 1941, "01223243830": 1942, "rate": 1943, "01223355159": 1944, "l": 1945, "01223351707": 1946, "40210": 1947, "scheduled": 1948, "cb21en": 1949, "g6": 1950, "13:27": 1951, "the missing sock": 1952, "thornton": 1953, "cb12dp": 1954, "information:booking": 1955, "cb23hg": 1956, "cb23pq": 1957, "basque": 1958, "jedburgh": 1959, "5:35": 1960, "cb58ld": 1961, "10:58": 1962, "hm": 1963, "cb21su": 1964, "romanian": 1965, "barbeque": 1966, "industrial": 1967, "15:35": 1968, "gog": 1969, "magog": 1970, "babraham": 1971, "form": 1972, "clubs": 1973, "01223354382": 1974, "sussex": 1975, "15:01": 1976, "cb22ha": 1977, "t": 1978, "01223324222": 1979, "spots": 1980, "05:58": 1981, "panasian": 1982, "cherry hinton hall and grounds": 1983, "01223295264": 1984, "5:59": 1985, "19:27": 1986, "except": 1987, "40270": 1988, "g4": 1989, "1416": 1990, "cb23na": 1991, "01223304906": 1992, "17.6": 1993, "cant": 1994, "cb11pt": 1995, "away": 1996, "charges": 1997, "the junction": 1998, "taj tandoori": 1999, "cambridge museum of technology": 2000, "the lucky star": 2001, "05:35": 2002, "scott": 2003, "polar": 2004, "22:11": 2005, "01223335511": 2006, "eatery": 2007, "singaporean": 2008, "7:17": 2009, "settle": 2010, "7:15": 2011, "royal standard": 2012, "museum of classical archaeology": 2013, "loch fyne": 2014, "great saint marys church": 2015, "cb58hy": 2016, "14.32": 2017, "06:43": 2018, "01223364222": 2019, "09:54": 2020, "retail": 2021, "accept": 2022, "10:10": 2023, "decide": 2024, "gathering": 2025, "swimmingpools": 2026, "world": 2027, "eastside": 2028, "11:24": 2029, "tr8842": 2030, "cb17sr": 2031, "dozens": 2032, "34": 2033, "9:21": 2034, "openings": 2035, "cb23bj": 2036, "sturton": 2037, "cb41jy": 2038, "01480446000": 2039, "cb43px": 2040, "suits": 2041, "5:17": 2042, "10:11": 2043, "13:54": 2044, "favorites": 2045, "23:40": 2046, "cb23rh": 2047, "nando": 2048, "cambridge chop house": 2049, "the varsity restaurant": 2050, "bunch": 2051, "290": 2052, "13:51": 2053, "lower": 2054, "cb30ad": 2055, "12:01": 2056, "9:01": 2057, "01223367660": 2058, "251a": 2059, "75.09": 2060, "sala thong": 2061, "cambridge arts theatre": 2062, "cambridge punter": 2063, "17:58": 2064, "01223518111": 2065, "17:54": 2066, "01223355017": 2067, "5:15": 2068, "07782218745": 2069, "entertaining": 2070, "01223353248": 2071, "gueshouse": 2072, "3.52": 2073, "152154": 2074, "nandos city centre": 2075, "peking restaurant": 2076, "09:50": 2077, "09:59": 2078, "cambridge lodge restaurant": 2079, "clare college": 2080, "williams art and antiques": 2081, "17:40": 2082, "01223302330": 2083, "famous": 2084, "hilton": 2085, "529": 2086, "06:08": 2087, "pulled": 2088, "01223842725": 2089, "01223519224": 2090, "01223332138": 2091, "facilities": 2092, "1519": 2093, "vere": 2094, "clear": 2095, "11:11": 2096, "cb58rs": 2097, "response": 2098, "fan": 2099, "pizza hut cherry hinton": 2100, "rice boat": 2101, "the gandhi": 2102, "7:29": 2103, "expect": 2104, "19:50": 2105, "eateries": 2106, "12:09": 2107, "11:27": 2108, "resturant": 2109, "depends": 2110, "ref#": 2111, "12:21": 2112, "17:39": 2113, "cb21tl": 2114, "big": 2115, "01223277977": 2116, "adjust": 2117, "01223333200": 2118, "plaza": 2119, "01223566188": 2120, "15:50": 2121, "optional": 2122, "towards": 2123, "cafe uno": 2124, "kettles yard": 2125, "09:39": 2126, "restaurant 17": 2127, "the place": 2128, "darn": 2129, "cb21eg": 2130, "152": 2131, "higher": 2132, "09:01": 2133, "05:32": 2134, "cb21qy": 2135, "01223302579": 2136, "19:07": 2137, "01223368650": 2138, "directly": 2139, "cb21uf": 2140, "16:36": 2141, "appeal": 2142, "15:24": 2143, "int": 2144, "tomorrow": 2145, "backstreet bistro": 2146, "city stop restaurant": 2147, "08:09": 2148, "01223327978": 2149, "19:09": 2150, "passengers": 2151, "21:40": 2152, "cb21jf": 2153, "01223312843": 2154, "169": 2155, "decided": 2156, "misspoke": 2157, "cb238el": 2158, "09:21": 2159, "shopping": 2160, "11:16": 2161, "falls": 2162, "cb19ej": 2163, "options:": 2164, "magdalene college": 2165, "ali baba": 2166, "23:35": 2167, "01223315702": 2168, "shortly": 2169, "17:27": 2170, "confusing": 2171, "5:29": 2172, "15:58": 2173, "tr7966": 2174, "66": 2175, "172": 2176, "fifteen": 2177, "01223477900": 2178, "copper kettle": 2179, "cow pizza kitchen and bar": 2180, "stazione restaurant and coffee bar": 2181, "kings college": 2182, "zizzi cambridge": 2183, "attend": 2184, "result": 2185, "18:32": 2186, "following": 2187, "12:24": 2188, "cb30nd": 2189, "wants": 2190, "uh": 2191, "otherwise": 2192, "01223812660": 2193, "9:09": 2194, "visitors": 2195, "16:01": 2196, "decent": 2197, "pumping": 2198, "cheddars": 2199, "01223362456": 2200, "operation": 2201, "13:32": 2202, "01223338000": 2203, "luxury": 2204, "6:07": 2205, "09:09": 2206, "16.6": 2207, "barbecue": 2208, "12:40": 2209, "drop": 2210, "served": 2211, "child": 2212, "20:24": 2213, "01223511511": 2214, "appealing": 2215, "who": 2216, "18:24": 2217, "jesus green outdoor pool": 2218, "17:01": 2219, "restaurant 2 two": 2220, "email": 2221, "01223351241": 2222, "worries": 2223, "5:01": 2224, "09:52": 2225, "she": 2226, "01223368786": 2227, "214": 2228, "19:11": 2229, "required": 2230, "finish": 2231, "alternate": 2232, "19:01": 2233, "talk": 2234, "crowne": 2235, "thankyou": 2236, "17:51": 2237, "08:23": 2238, "16:11": 2239, "2,828": 2240, "10:08": 2241, "single": 2242, "canapes": 2243, "emmanuel college": 2244, "de luca cucina and bar": 2245, "zealand": 2246, "05:30": 2247, "tandoor": 2248, "50.5": 2249, "139": 2250, "6:30": 2251, "cb23ar": 2252, "sport": 2253, "5:09": 2254, "move": 2255, "cb12as": 2256, "23:39": 2257, "drive": 2258, "13:58": 2259, "01223503333": 2260, "01223248882": 2261, "fairly": 2262, "pulling": 2263, "computer": 2264, "anyone": 2265, "cherry hinton water play": 2266, "mumford theatre": 2267, "cherry hinton village centre": 2268, "24:45": 2269, "saint johns chop house": 2270, "thirteen": 2271, "cb21st": 2272, "easy": 2273, "doubletree": 2274, "cb41as": 2275, "01223240089": 2276, "19:17": 2277, "everyone": 2278, "approximately": 2279, "helps": 2280, "stevanage": 2281, "eclectic": 2282, "20:08": 2283, "84": 2284, "09:35": 2285, "17:35": 2286, "tr5219": 2287, "sights": 2288, "telling": 2289, "14:58": 2290, "17:55": 2291, "cb41xa": 2292, "golden curry": 2293, "sitar tandoori": 2294, "save": 2295, "reasonably": 2296, "stuff": 2297, "19:58": 2298, "arrived": 2299, "offered": 2300, "01223412299": 2301, "01223276653": 2302, "01223363471": 2303, "16:09": 2304, "took": 2305, "9:07": 2306, "22:00": 2307, "complimentary": 2308, "hurt": 2309, "emergency": 2310, "17:32": 2311, "fro": 2312, "ot": 2313, "stayed": 2314, "23:01": 2315, "01223352607": 2316, "01223362372": 2317, "learn": 2318, "treat": 2319, "golden house": 2320, "16:32": 2321, "global": 2322, "08:07": 2323, "05:45": 2324, "15:06": 2325, "rice house": 2326, "10:24": 2327, "12:52": 2328, "bored": 2329, "print": 2330, "01223412430": 2331, "21:21": 2332, "10:09": 2333, "05:39": 2334, "saying": 2335, "historical": 2336, "riding": 2337, "11:40": 2338, "01223512596": 2339, "lookup": 2340, "insanely": 2341, "narrowing": 2342, "04:00": 2343, "yourself": 2344, "walking": 2345, "final": 2346, "sadly": 2347, "midsummer house restaurant": 2348, "kings hedges learner pool": 2349, "darrys cookhouse and wine shop": 2350, "j restaurant": 2351, "trinity college": 2352, "11:39": 2353, "11:09": 2354, "732734": 2355, "07807718591": 2356, "cb41eh": 2357, "15:40": 2358, "01223335153": 2359, "12.8": 2360, "cb23ap": 2361, "postcode:": 2362, "cb43le": 2363, "01223360966": 2364, "add": 2365, "afford": 2366, "4753": 2367, "math": 2368, "cb39ey": 2369, "town:": 2370, "proper": 2371, "previously": 2372, "came": 2373, "12:32": 2374, "01223727410": 2375, "15:54": 2376, "01223352500": 2377, "15:36": 2378, "11:58": 2379, "80": 2380, "19:40": 2381, "cb42je": 2382, "month": 2383, "disappointing": 2384, "05:15": 2385, "la mimosa": 2386, "assume": 2387, "9:39": 2388, "tr5767": 2389, "darry": 2390, "01223361763": 2391, "regretfully": 2392, "19:59": 2393, "18:21": 2394, "opinion": 2395, "01223359750": 2396, "19:51": 2397, "cb21ta": 2398, "standsted": 2399, "15:16": 2400, "live": 2401, "hard": 2402, "01223302010": 2403, "whipple museum of the history of science": 2404, "queens college": 2405, "the fez club": 2406, "curious": 2407, "619": 2408, "3334": 2409, "supposed": 2410, "01223334200": 2411, "miss": 2412, "18:10": 2413, "closed": 2414, "cb58pa": 2415, "01223311625": 2416, "chosen": 2417, "12:06": 2418, "dear": 2419, "7:00": 2420, "yea": 2421, "address:": 2422, "01223311911": 2423, "job": 2424, "experiencing": 2425, "hot": 2426, "front": 2427, "suffice": 2428, "cambride": 2429, "brazilian": 2430, "14:09": 2431, "07:00": 2432, "20:23": 2433, "196": 2434, "11:36": 2435, "01223247877": 2436, "attention": 2437, "answer": 2438, "19:52": 2439, "mins": 2440, "17.89": 2441, "size": 2442, "modify": 2443, "cb42xh": 2444, "cb39lh": 2445, "01223366202": 2446, "cb23qb": 2447, "6:08": 2448, "09:16": 2449, "gotten": 2450, "10:54": 2451, "10:55": 2452, "cb23hx": 2453, "183": 2454, "destinations": 2455, "campus": 2456, "46": 2457, "large": 2458, "3:15": 2459, "chesteron": 2460, "cambrdige": 2461, "unless": 2462, "cb58nt": 2463, "regency": 2464, "16:58": 2465, "14:43": 2466, "09:06": 2467, "efes restaurant": 2468, "8:07": 2469, "12:55": 2470, "tr2083": 2471, "plus": 2472, "05:16": 2473, "01223241387": 2474, "01223244277": 2475, "y": 2476, "reachable": 2477, "events": 2478, "bring": 2479, "whole": 2480, "appeals": 2481, "tr5154": 2482, "tons": 2483, "thompsons": 2484, "movie": 2485, "13.2": 2486, "cb11eg": 2487, "silly": 2488, "14:23": 2489, "respectively": 2490, "dale": 2491, "brewery": 2492, "13:24": 2493, "151.19": 2494, "72": 2495, "07:29": 2496, "5:36": 2497, "52.8": 2498, "low": 2499, "cb23ll": 2500, "aylesbury": 2501, "stanford": 2502, "constraint": 2503, "17:16": 2504, "restaurant alimentum": 2505, "07:21": 2506, "sight": 2507, "terms": 2508, "you:": 2509, "10:35": 2510, "15:59": 2511, "unique": 2512, "grab": 2513, "05:24": 2514, "neat": 2515, "01223506055": 2516, "hate": 2517, "21:39": 2518, "17:07": 2519, "fully": 2520, "lasting": 2521, "40.4": 2522, "above": 2523, "cb30ag": 2524, "involving": 2525, "liking": 2526, "cb21db": 2527, "completely": 2528, "distance": 2529, "desk": 2530, "14:40": 2531, "music": 2532, "southend": 2533, "restaraunt": 2534, "meze bar": 2535, "fitzwilliam museum": 2536, "20:01": 2537, "02:15": 2538, "yummy": 2539, "18:11": 2540, "tr9859": 2541, "read": 2542, "06:10": 2543, "deciding": 2544, "regardless": 2545, "cb21uj": 2546, "08:58": 2547, "tr0927": 2548, "9.8": 2549, "14:24": 2550, "01223748100": 2551, "providing": 2552, "21:59": 2553, "01223323361": 2554, "01223351880": 2555, "5:16": 2556, "01223400170": 2557, "vary": 2558, "01223362525": 2559, "cb23pp": 2560, "19:06": 2561, "17:08": 2562, "01223332400": 2563, "gwydir": 2564, "exists": 2565, "left": 2566, "07:07": 2567, "14:32": 2568, "mine": 2569, "01223338400": 2570, "india house": 2571, "pipasha restaurant": 2572, "cb13nf": 2573, "13:06": 2574, "12:43": 2575, "11:07": 2576, "12:38": 2577, "owe": 2578, "cb23jx": 2579, "18:58": 2580, "tr4748": 2581, "12:11": 2582, "alot": 2583, "7:11": 2584, "state": 2585, "22:08": 2586, "18:08": 2587, "makes": 2588, "restraunt": 2589, "cb39al": 2590, "avoid": 2591, "matters": 2592, "future": 2593, "nevermind": 2594, "placed": 2595, "soonest": 2596, "shows": 2597, "th": 2598, "cb12lj": 2599, "previous": 2600, "starving": 2601, "01223217118": 2602, "points": 2603, "event": 2604, "honestly": 2605, "20:21": 2606, "tr0254": 2607, "odd": 2608, "13:09": 2609, "12:58": 2610, "01223315232": 2611, "driving": 2612, "lasts": 2613, "23:11": 2614, "5:24": 2615, "cb43ht": 2616, "01223505015": 2617, "cb43hl": 2618, "are:": 2619, "outside": 2620, "20:11": 2621, "cb41uy": 2622, "helped": 2623, "01223244149": 2624, "discussed": 2625, "59": 2626, "steakhouses": 2627, "pricier": 2628, "qualifications": 2629, "buildings": 2630, "medicine": 2631, "01223575122": 2632, "01223350059": 2633, "that'd": 2634, "lynne strover gallery": 2635, "35.2": 2636, "4:15": 2637, "06:09": 2638, "answered": 2639, "inquiry": 2640, "mistaken": 2641, "looked": 2642, "centre:": 2643, "michael": 2644, "daily": 2645, "07:52": 2646, "ian": 2647, "tr2515": 2648, "7:52": 2649, "tr2987": 2650, "hotspot": 2651, "05:36": 2652, "01223353110": 2653, "01223247942": 2654, "football": 2655, "paying": 2656, "impress": 2657, "10:16": 2658, "numerous": 2659, "prefered": 2660, "16:55": 2661, "cb30lx": 2662, "16:10": 2663, "appropriate": 2664, "itinerary": 2665, "14:11": 2666, "the river bar steakhouse and grill": 2667, "clowns cafe": 2668, "pizza hut city centre": 2669, "reference:": 2670, "9:29": 2671, "terrific": 2672, "tight": 2673, "toward": 2674, "medical": 2675, "zip": 2676, "01799521260": 2677, "heart": 2678, "congratulations": 2679, "07:15": 2680, "changing": 2681, "happens": 2682, "connect": 2683, "19:08": 2684, "among": 2685, "9:17": 2686, "14:10": 2687, "11:55": 2688, "20:32": 2689, "current": 2690, "30.29": 2691, "operating": 2692, "cb21tw": 2693, "runs": 2694, "cb21tq": 2695, "cb17aa": 2696, "21:50": 2697, "cb21rb": 2698, "16:24": 2699, "huh": 2700, "small": 2701, "23:17": 2702, "89.5": 2703, "tr5348": 2704, "tea": 2705, "tr6838": 2706, "16:06": 2707, "dishes": 2708, "cetre": 2709, "drinks": 2710, "good luck": 2711, "scott polar museum": 2712, "facility": 2713, "18:36": 2714, "sesame restaurant and bar": 2715, "real": 2716, "5:50": 2717, "sufficient": 2718, "cb13nl": 2719, "01223324033": 2720, "7:27": 2721, "25": 2722, "80.8": 2723, "cb11ee": 2724, "01:30": 2725, "01223338300": 2726, "12:10": 2727, "19:54": 2728, "o": 2729, "pull": 2730, "longer": 2731, "14:54": 2732, "quayside": 2733, "u": 2734, "started": 2735, "sooner": 2736, "tax": 2737, "6:45": 2738, "23:21": 2739, "05:59": 2740, "8:43": 2741, "exist": 2742, "06:15": 2743, "cb23hu": 2744, "1,414": 2745, "21:35": 2746, "n": 2747, "londons": 2748, "cb21rq": 2749, "71.59": 2750, "tr8464": 2751, "sweet": 2752, "whenever": 2753, "17:17": 2754, "commuting": 2755, "21:36": 2756, "advance": 2757, "handle": 2758, "remembered": 2759, "tr7047": 2760, "occasion": 2761, "19:55": 2762, "70.7": 2763, "friendly": 2764, "saint johns college": 2765, "tang chinese": 2766, "maharajah tandoori restaurant": 2767, "sidney sussex college": 2768, "shanghai family restaurant": 2769, "fair": 2770, "01223331100": 2771, "01223355166": 2772, "01223448620": 2773, "categories": 2774, "15:32": 2775, "mainly": 2776, "01223356555": 2777, "cities": 2778, "01223247015": 2779, "tr2715": 2780, "exciting": 2781, "repeat": 2782, "guestroom": 2783, "01223362433": 2784, "bout": 2785, "11:50": 2786, "9:54": 2787, "01223357851": 2788, "petersborough": 2789, "process": 2790, "highest": 2791, "5:54": 2792, "01223462354": 2793, "wollaston": 2794, "01223334898": 2795, "cb43pe": 2796, "movies": 2797, "22:07": 2798, "tr8494": 2799, "level": 2800, "tourists": 2801, "6:55": 2802, "cb12qa": 2803, "speak": 2804, "hundred": 2805, "tr6524": 2806, "spread": 2807, "lan hong house": 2808, "sheeps green and lammas land park fen causeway": 2809, "04:45": 2810, "curry king": 2811, "37.79": 2812, "pickup": 2813, "01223312598": 2814, "01223356354": 2815, "tr1163": 2816, "matched": 2817, "8:08": 2818, "break": 2819, "quickly": 2820, "region": 2821, "dropped": 2822, "01223464630": 2823, "06:45": 2824, "01223338800": 2825, "reputation": 2826, "tr6003": 2827, "menu": 2828, "12:23": 2829, "rates": 2830, "01223227330": 2831, "01223353071": 2832, "99": 2833, "burleigh": 2834, "tr6742": 2835, "oops": 2836, "07:06": 2837, "7:54": 2838, "board": 2839, "available:": 2840, "necessity": 2841, "riders": 2842, "07:19": 2843, "mostly": 2844, "tr6009": 2845, "5:32": 2846, "adults": 2847, "saint catharines college": 2848, "2:30": 2849, "06:30": 2850, "don pasquale pizzeria": 2851, "the hotpot": 2852, "taste": 2853, "tr1499": 2854, "extremely": 2855, "21:54": 2856, "06:32": 2857, "managed": 2858, "09:11": 2859, "cb41sr": 2860, "01223259988": 2861, "bishop": 2862, "pasta": 2863, "5:45": 2864, "wherever": 2865, "08:40": 2866, "potential": 2867, "08719429180": 2868, "cutting": 2869, "8:58": 2870, "tr8903": 2871, "tr8860": 2872, "11:44": 2873, "postalcode": 2874, "cb13lh": 2875, "recheck": 2876, "difference": 2877, "tr5729": 2878, "feeling": 2879, "persons": 2880, "ghandi": 2881, "hogwarts": 2882, "03:45": 2883, "historic": 2884, "18:52": 2885, "13:07": 2886, "truly": 2887, "hotel du vin and bistro": 2888, "the slug and lettuce": 2889, "pembroke college": 2890, "trust": 2891, "little saint marys church": 2892, "cambridge book and print gallery": 2893, "peoples portraits exhibition at girton college": 2894, "gonville and caius college": 2895, "2:45": 2896, "tr9561": 2897, "01842753771": 2898, "surprisingly": 2899, "wished": 2900, "fir": 2901, "flying": 2902, "01223568988": 2903, "enjoyed": 2904, "70.4": 2905, "01223364319": 2906, "accomodations": 2907, "01223329432": 2908, "cb23nj": 2909, "create": 2910, "her": 2911, "tr3225": 2912, "05:09": 2913, "short": 2914, "tr7733": 2915, "01223425478": 2916, "tr1492": 2917, "01223364917": 2918, "01223311053": 2919, "information:": 2920, "01223363682": 2921, "sometimes": 2922, "area:": 2923, "22:40": 2924, "considering": 2925, "chines": 2926, "01223302580": 2927, "tr9937": 2928, "mall": 2929, "12:34": 2930, "themed": 2931, "half": 2932, "01223357187": 2933, "true": 2934, "liek": 2935, "15:09": 2936, "scudamores punting co": 2937, "07:54": 2938, "02:45": 2939, "stratford": 2940, "wise": 2941, "gallery at 12 a high street": 2942, "gueshouses": 2943, "12:54": 2944, "cb11lh": 2945, "05:50": 2946, "19:32": 2947, "21:11": 2948, "terribly": 2949, "231": 2950, "daughter": 2951, "joining": 2952, "complex": 2953, "ooh": 2954, "covers": 2955, "9:35": 2956, "07:35": 2957, "benny": 2958, "cb21aw": 2959, "10:36": 2960, "02:00": 2961, "75.59": 2962, "18:35": 2963, "01223323639": 2964, "involved": 2965, "anniversary": 2966, "nicer": 2967, "15:51": 2968, "towns": 2969, "8:24": 2970, "82.5": 2971, "egg": 2972, "rolls": 2973, "luncheon": 2974, "trick": 2975, "joint": 2976, "20:55": 2977, "fascinating": 2978, "spending": 2979, "totally": 2980, "mixed": 2981, "tr7423": 2982, "common": 2983, "assuming": 2984, "cb43lf": 2985, "phone:": 2986, "surrounding": 2987, "tr1502": 2988, "sells": 2989, "cambidge": 2990, "07:17": 2991, "22:45": 2992, "hk fusion": 2993, "ago": 2994, "35.79": 2995, "allowing": 2996, "precise": 2997, "23.6": 2998, "online": 2999, 