{"[PAD]": 0, "[UNK]": 1, "[MASK]": 2, "[attraction_area]": 3, "[attraction_name]": 4, "[attraction_type]": 5, "[hotel_area]": 6, "[hotel_day]": 7, "[hotel_internet]": 8, "[hotel_name]": 9, "[hotel_parking]": 10, "[hotel_people]": 11, "[hotel_pricerange]": 12, "[hotel_stars]": 13, "[hotel_stay]": 14, "[hotel_type]": 15, "[restaurant_area]": 16, "[restaurant_day]": 17, "[restaurant_food]": 18, "[restaurant_name]": 19, "[restaurant_people]": 20, "[restaurant_pricerange]": 21, "[restaurant_time]": 22, "[taxi_arriveby]": 23, "[taxi_departure]": 24, "[taxi_destination]": 25, "[taxi_leaveat]": 26, "[train_arriveby]": 27, "[train_day]": 28, "[train_departure]": 29, "[train_destination]": 30, "[train_leaveat]": 31, "[train_people]": 32, "none": 33, ".": 34, "i": 35, "[USER]": 36, "?": 37, "the": 38, "you": 39, "a": 40, "[SYSTEM]": 41, "to": 42, ",": 43, "for": 44, "in": 45, "is": 46, "and": 47, "would": 48, "that": 49, "like": 50, "can": 51, "there": 52, "of": 53, "have": 54, "are": 55, "am": 56, "need": 57, "me": 58, "it": 59, "on": 60, "do": 61, "at": 62, "restaurant": 63, "yes": 64, "looking": 65, "please": 66, "what": 67, "book": 68, "number": 69, "be": 70, "cambridge": 71, "hotel": 72, "-s": 73, "with": 74, "train": 75, "town": 76, "price": 77, "your": 78, "place": 79, "help": 80, "free": 81, "area": 82, "centre": 83, "will": 84, "from": 85, "not": 86, "1": 87, "range": 88, "also": 89, "food": 90, "any": 91, "find": 92, "no": 93, "stay": 94, "time": 95, "s": 96, "reference": 97, "people": 98, "about": 99, "or": 100, "guesthouse": 101, "!": 102, "star": 103, "4": 104, "moderate": 105, "phone": 106, "anything": 107, "how": 108, "want": 109, "by": 110, "else": 111, "hotel-name": 112, "restaurant-food": 113, "expensive": 114, "train-destination": 115, "address": 116, "an": 117, "train-departure": 118, "restaurant-name": 119, "get": 120, "located": 121, "leave": 122, "type": 123, "cheap": 124, "postcode": 125, "could": 126, "2": 127, "north": 128, "sure": 129, "information": 130, "but": 131, "day": 132, "go": 133, "arrive": 134, "great": 135, "we": 136, "restaurant-area": 137, "restaurant-pricerange": 138, "nights": 139, "parking": 140, "booking": 141, "table": 142, "leaving": 143, "does": 144, "as": 145, "priced": 146, "try": 147, "reservation": 148, "was": 149, "3": 150, "where": 151, "should": 152, "after": 153, "thank": 154, "if": 155, "-ly": 156, "attraction-name": 157, "sorry": 158, "their": 159, "many": 160, "recommend": 161, "train-day": 162, "attraction-type": 163, "just": 164, "east": 165, "west": 166, "prefer": 167, "part": 168, "has": 169, "hotel-type": 170, "some": 171, "hotel-area": 172, "hotel-stars": 173, "they": 174, "okay": 175, "south": 176, "hotel-pricerange": 177, "something": 178, "fee": 179, "preference": 180, "available": 181, "house": 182, "5": 183, "this": 184, "city": 185, "all": 186, "attraction-area": 187, "give": 188, "leaves": 189, "departing": 190, "make": 191, "which": 192, "thanks": 193, "going": 194, "starting": 195, "wifi": 196, "serves": 197, "different": 198, "trains": 199, "street": 200, "attraction": 201, "options": 202, "stars": 203, "hotel-parking": 204, "travel": 205, "entrance": 206, "hotel-internet": 207, "more": 208, "tell": 209, "good": 210, "side": 211, "know": 212, "room": 213, "another": 214, "restaurant-bookpeople": 215, "taxi": 216, "sounds": 217, "particular": 218, "hi": 219, "hotel-bookpeople": 220, "booked": 221, "rating": 222, "same": 223, "criteria": 224, "my": 225, "restaurant-bookday": 226, "road": 227, "restaurant-booktime": 228, "hotel-bookstay": 229, "dontcare": 230, "i'll": 231, "museum": 232, "ok": 233, "arrives": 234, "indian": 235, "guesthouses": 236, "today": 237, "called": 238, "interested": 239, "friday": 240, "so": 241, "hotel-bookday": 242, "sunday": 243, "successful": 244, "work": 245, "college": 246, "chinese": 247, "visit": 248, "center": 249, "well": 250, "tuesday": 251, "saturday": 252, "thursday": 253, "mind": 254, "wednesday": 255, "attractions": 256, "other": 257, "internet": 258, "may": 259, "train-leaveat": 260, "really": 261, "monday": 262, "train-arriveby": 263, "those": 264, "tickets": 265, "them": 266, "include": 267, "specific": 268, "several": 269, "hello": 270, ":": 271, "eat": 272, "traveling": 273, "fine": 274, "italian": 275, "departure": 276, "cuisine": 277, "depart": 278, "arriving": 279, "minutes": 280, "actually": 281, "guest": 282, "matter": 283, "destination": 284, "found": 285, "location": 286, "ticket": 287, "let": 288, "station": 289, "when": 290, "pounds": 291, "dine": 292, "needs": 293, "look": 294, "trip": 295, "train-bookpeople": 296, "6": 297, "check": 298, "museums": 299, "suggest": 300, "both": 301, "british": 302, "certain": 303, "did": 304, "breakfast": 305, "see": 306, "bed": 307, "7": 308, "provide": 309, "care": 310, "unfortunately": 311, "much": 312, "park": 313, "take": 314, "instead": 315, "8": 316, "serve": 317, "then": 318, "down": 319, "meet": 320, "narrow": 321, "nice": 322, "staying": 323, "choose": 324, "15": 325, "able": 326, "up": 327, "long": 328, "arrival": 329, "european": 330, "too": 331, "kings": 332, "total": 333, "out": 334, "now": 335, "entertainment": 336, "code": 337, "first": 338, "search": 339, "assist": 340, "london": 341, "reserved": 342, "reserve": 343, "either": 344, "planning": 345, "finding": 346, "offer": 347, "colleges": 348, "think": 349, "taxi-destination": 350, "id": 351, "info": 352, "ely": 353, "taxi-departure": 354, "kind": 355, "lodge": 356, "leicester": 357, "only": 358, "gbp": 359, "departs": 360, "fit": 361, "acorn": 362, "norwich": 363, "perfect": 364, "happy": 365, "few": 366, "contact": 367, "preferences": 368, "post": 369, "broxbourne": 370, "certainly": 371, "peterborough": 372, "pick": 373, "saint": 374, "bar": 375, "match": 376, "night": 377, "person": 378, "very": 379, "stevenage": 380, "0": 381, "were": 382, "cost": 383, "payable": 384, "serving": 385, "request": 386, "architecture": 387, "perhaps": 388, "maybe": 389, "near": 390, "name": 391, "between": 392, "somewhere": 393, "possible": 394, "these": 395, "hospital": 396, "oh": 397, "matching": 398, "9": 399, "though": 400, "shall": 401, "requirement": 402, "here": 403, "while": 404, "choices": 405, "theatre": 406, "course": 407, "chesterton": 408, "before": 409, "pool": 410, "right": 411, "cherry": 412, "days": 413, "us": 414, "hinton": 415, "gonville": 416, "results": 417, "10": 418, "reservations": 419, "university": 420, "local": 421, "offers": 422, "way": 423, "its": 424, "admission": 425, "quite": 426, "thing": 427, "church": 428, "love": 429, "alexander": 430, "cross": 431, "hour": 432, "gallery": 433, "11": 434, "milton": 435, "party": 436, "got": 437, "sound": 438, "ashley": 439, "liverpool": 440, "best": 441, "king": 442, "absolutely": 443, "matches": 444, "car": 445, "new": 446, "meets": 447, "pizza": 448, "asian": 449, "boat": 450, "coming": 451, "rated": 452, "lane": 453, "trying": 454, "allenbell": 455, "cannot": 456, "favorite": 457, "fun": 458, "still": 459, "might": 460, "been": 461, "heading": 462, "arms": 463, "into": 464, "airport": 465, "cinema": 466, "alright": 467, "sports": 468, "set": 469, "lynn": 470, "bishops": 471, "modern": 472, "wanting": 473, "hoping": 474, "little": 475, "regent": 476, "again": 477, "suggestions": 478, "curry": 479, "definitely": 480, "swimming": 481, "around": 482, "nothing": 483, "lensfield": 484, "choice": 485, "listed": 486, "cityroomz": 487, "call": 488, "later": 489, "send": 490, "birmingham": 491, "yeah": 492, "lot": 493, "huntingdon": 494, "unable": 495, "stansted": 496, "21": 497, "every": 498, "london liverpool street": 499, "change": 500, "acorn guest house": 501, "stortford": 502, "made": 503, "further": 504, "fen": 505, "express": 506, "33": 507, "over": 508, "el": 509, "pools": 510, "preferred": 511, "shaddai": 512, "gastropub": 513, "recommendation": 514, "nightclub": 515, "kings lynn": 516, "seat": 517, "option": 518, "visiting": 519, "multiple": 520, "stansted airport": 521, "most": 522, "belfry": 523, "things": 524, "nightclubs": 525, "needed": 526, "oriental": 527, "interesting": 528, "london kings cross": 529, "la": 530, "birmingham new street": 531, "bishops stortford": 532, "portuguese": 533, "needing": 534, "close": 535, "our": 536, "yet": 537, "african": 538, "than": 539, "fits": 540, "bridge": 541, "problem": 542, "marriott": 543, "13": 544, "wonderful": 545, "taxi-leaveat": 546, "13:00": 547, "parks": 548, "international": 549, "noodle": 550, "open": 551, "police": 552, "trinity": 553, "ahead": 554, "turkish": 555, "preferably": 556, "parkside": 557, "such": 558, "closest": 559, "christ": 560, "start": 561, "ask": 562, "excellent": 563, "venue": 564, "ditton": 565, "17:00": 566, "looks": 567, "b": 568, "17:45": 569, "art": 570, "seats": 571, "end": 572, "12:15": 573, "shorter": 574, "earliest": 575, "12:30": 576, "goes": 577, "11:00": 578, "travelling": 579, "rosa": 580, "14:45": 581, "17": 582, "14": 583, "unsuccessful": 584, "12:00": 585, "spanish": 586, "interest": 587, "rooms": 588, "per": 589, "11:45": 590, "lovell": 591, "bistro": 592, "suit": 593, "23": 594, "19:30": 595, "hall": 596, "mediterranean": 597, "16:45": 598, "apologize": 599, "11:30": 600, "12:45": 601, "15:15": 602, "thai": 603, "description": 604, "avalon": 605, "ones": 606, "19": 607, "addenbrookes": 608, "earlier": 609, "hills": 610, "hut": 611, "french": 612, "16:00": 613, "assistance": 614, "13:45": 615, "15:45": 616, "myself": 617, "15:00": 618, "18:15": 619, "headed": 620, "golden": 621, "types": 622, "times": 623, "12": 624, "15:30": 625, "clifton": 626, "16:30": 627, "11:15": 628, "vietnamese": 629, "works": 630, "16:15": 631, "afraid": 632, "showing": 633, "17:30": 634, "14:30": 635, "postal": 636, "better": 637, "holiday": 638, "mexican": 639, "costs": 640, "dining": 641, "alexander bed and breakfast": 642, "lots": 643, "garden": 644, "show": 645, "telephone": 646, "system": 647, "bedouin": 648, "17:15": 649, "list": 650, "welcome": 651, "leisure": 652, "locate": 653, "club": 654, "confirm": 655, "group": 656, "14:00": 657, "18:30": 658, "cafe": 659, "inn": 660, "date": 661, "wanted": 662, "beginning": 663, "back": 664, "jesus": 665, "heard": 666, "ride": 667, "im": 668, "13:30": 669, "tandoori": 670, "lets": 671, "site": 672, "however": 673, "mill": 674, "inexpensive": 675, "is:": 676, "13:15": 677, "nearby": 678, "taxi-arriveby": 679, "green": 680, "18:00": 681, "worth": 682, "warkworth": 683, "guess": 684, "commute": 685, "listings": 686, "20:00": 687, "19:00": 688, "meeting": 689, "wait": 690, "nandos": 691, "aylesbray": 692, "newmarket": 693, "popular": 694, "autumn": 695, "next": 696, "lodging": 697, "country": 698, "theatres": 699, "21:00": 700, "magdalene": 701, "use": 702, "guests": 703, "bit": 704, "plenty": 705, "department": 706, "castle": 707, "fees": 708, "enter": 709, "swimming pool": 710, "44": 711, "night club": 712, "recommendations": 713, "arbury": 714, "21:15": 715, "high": 716, "enjoy": 717, "entries": 718, "18": 719, "houses": 720, "important": 721, "specification": 722, "79": 723, "least": 724, "lovely": 725, "-er": 726, "schedule": 727, "mary": 728, "19:15": 729, "rather": 730, "tourist": 731, "hmm": 732, "american": 733, "hamilton": 734, "10:30": 735, "parade": 736, "saints": 737, "hospital-department": 738, "18:45": 739, "accommodations": 740, "point": 741, "09:15": 742, "downing": 743, "wondering": 744, "correct": 745, "details": 746, "20:15": 747, "rd": 748, "we'll": 749, "availability": 750, "sometime": 751, "boating": 752, "154": 753, "confirmation": 754, "named": 755, "hey": 756, "korean": 757, "broughton": 758, "morning": 759, "royal": 760, "14:15": 761, "must": 762, "excited": 763, "21:30": 764, "wish": 765, "early": 766, "had": 767, "asian oriental": 768, "finches": 769, "thinking": 770, "hobsons": 771, "concerthall": 772, "old": 773, "picked": 774, "10:15": 775, "sort": 776, "boats": 777, "nusha": 778, "andrew": 779, "artworks": 780, "successfully": 781, "st": 782, "home": 783, "clare": 784, "21:45": 785, "prince": 786, "others": 787, "yard": 788, "graffiti": 789, "someplace": 790, "amenities": 791, "listing": 792, "rice": 793, "churches": 794, "anatolia": 795, "ashley hotel": 796, "camboats": 797, "tenpin": 798, "said": 799, "additional": 800, "kohinoor": 801, "once": 802, "churchill": 803, "seems": 804, "20:45": 805, "pay": 806, "pricing": 807, "university arms hotel": 808, "accommodate": 809, "whatever": 810, "modern european": 811, "alpha": 812, "week": 813, "10:45": 814, "10:00": 815, "chop": 816, "10.10": 817, "within": 818, "everything": 819, "forward": 820, "come": 821, "19:45": 822, "24": 823, "say": 824, "08:15": 825, "seeing": 826, "suggestion": 827, "adc": 828, "require": 829, "&": 830, "chan": 831, "archway": 832, "gets": 833, "hakka": 834, "off": 835, "business": 836, "08:30": 837, "09:30": 838, "getting": 839, "cambridge belfry": 840, "charlie": 841, "passage": 842, "moment": 843, "gonville hotel": 844, "leverton": 845, "included": 846, "09:45": 847, "including": 848, "pizzeria": 849, "mentioned": 850, "luck": 851, "happen": 852, "last": 853, "kettle": 854, "ready": 855, "awesome": 856, "cb17dy": 857, "each": 858, "plan": 859, "22": 860, "hold": 861, "during": 862, "style": 863, "specifically": 864, "seem": 865, "#": 866, "anytime": 867, "market": 868, "concert": 869, "soon": 870, "08:45": 871, "unit": 872, "wok": 873, "tonight": 874, "duration": 875, "school": 876, "vue": 877, "route": 878, "far": 879, "whether": 880, "jello": 881, "questions": 882, "carolina": 883, "lebanese": 884, "numbers": 885, "slot": 886, "consider": 887, "gardens": 888, "express by holiday inn cambridge": 889, "barnabas": 890, "brasserie": 891, "kymmoy": 892, "possibly": 893, "japanese": 894, "county": 895, "wandlebury": 896, "checking": 897, "seafood": 898, "galleria": 899, "tree": 900, "primavera": 901, "galleries": 902, "hear": 903, "dinner": 904, "pm": 905, "nirala": 906, "told": 907, "latest": 908, "meghna": 909, "dont": 910, "dojo": 911, "ballare": 912, "soul": 913, "08:00": 914, "cool": 915, "cb41da": 916, "kitchen": 917, "entry": 918, "yippee": 919, "schools": 920, "specify": 921, "eraina": 922, "highly": 923, "oak": 924, "09:00": 925, "riverboat": 926, "20:30": 927, "fitting": 928, "money": 929, "willing": 930, "georgina": 931, "prezzo": 932, "huntingdon marriott hotel": 933, "christ college": 934, "cinemas": 935, "spice": 936, "nearest": 937, "requests": 938, "grafton": 939, "run": 940, "offering": 941, "northern": 942, "andrews": 943, "evening": 944, "necessary": 945, "appreciate": 946, "zero": 947, "fi": 948, "funky": 949, "minute": 950, "fantastic": 951, "mood": 952, "51": 953, "pretty": 954, "we're": 955, "austrian": 956, "without": 957, "lucky": 958, "theater": 959, "20": 960, "variety": 961, "salsa": 962, "wi": 963, "charge": 964, "since": 965, "done": 966, "de": 967, "picky": 968, "hamilton lodge": 969, "88": 970, "already": 971, "el shaddia guesthouse": 972, "newnham": 973, "da": 974, "hedges": 975, "man": 976, "access": 977, "archaeology": 978, "forgot": 979, "vinci": 980, "bloomsbury": 981, "portugese": 982, "error": 983, "exactly": 984, "hobsons house": 985, "histon": 986, "couple": 987, "rest": 988, "ranging": 989, "arts": 990, "lensfield hotel": 991, "complete": 992, "varsity": 993, "8:30": 994, "technology": 995, "play": 996, "holy": 997, "abbey": 998, "budget": 999, "a and b guest house": 1000, "folk": 1001, "cote": 1002, "binh": 1003, "alimentum": 1004, "reach": 1005, "thats": 1006, "shiraz": 1007, "thanh": 1008, "all saints church": 1009, "cb23bu": 1010, "section": 1011, "confusion": 1012, "01223358966": 1013, "requested": 1014, "running": 1015, "palace": 1016, "aylesbray lodge guest house": 1017, "hill": 1018, "limehouse": 1019, "beautiful": 1020, "mumford": 1021, "byard": 1022, "case": 1023, "clarify": 1024, "cineworld": 1025, "searching": 1026, "ugly": 1027, "raza": 1028, "01223353888": 1029, "upcoming": 1030, "why": 1031, "98": 1032, "56": 1033, "anthropology": 1034, "bridge guest house": 1035, "jinling": 1036, "jamaican": 1037, "cb11ln": 1038, "goodbye": 1039, "service": 1040, "full": 1041, "uno": 1042, "29": 1043, "completed": 1044, "regarding": 1045, "finches bed and breakfast": 1046, "rajmahal": 1047, "whichever": 1048, "afternoon": 1049, "botanic": 1050, "exchange": 1051, "100": 1052, "autumn house": 1053, "trumpington": 1054, "interests": 1055, "idea": 1056, "surprise": 1057, "until": 1058, "johns": 1059, "duckling": 1060, "second": 1061, "outdoor": 1062, "village": 1063, "gandhi": 1064, "rosas bed and breakfast": 1065, "163": 1066, "margherita": 1067, "riverside": 1068, "architectural": 1069, "fitzbillies": 1070, "victoria": 1071, "9:15": 1072, "corn": 1073, "recommended": 1074, "9:30": 1075, "bangkok": 1076, "01223446100": 1077, "order": 1078, "lodgings": 1079, "16": 1080, "luca": 1081, "chiquito": 1082, "we'd": 1083, "cocum": 1084, "catch": 1085, "moon": 1086, "number:": 1087, "70": 1088, "mimosa": 1089, "making": 1090, "cotto": 1091, "records": 1092, "greens": 1093, "category": 1094, "16.60": 1095, "fusion": 1096, "28": 1097, "contemporary": 1098, "broughton house gallery": 1099, "warkworth house": 1100, "cucina": 1101, "currently": 1102, "mean": 1103, "he": 1104, "missing": 1105, "gardenia": 1106, "having": 1107, "swimmingpool": 1108, "archway house": 1109, "keep": 1110, "restate": 1111, "23.60": 1112, "using": 1113, "head": 1114, "tasca": 1115, "stazione": 1116, "sidney": 1117, "reached": 1118, "arbury lodge guesthouse": 1119, "yu": 1120, "malaysian": 1121, "2.50": 1122, "curry garden": 1123, "cb20qq": 1124, "history": 1125, "worth house": 1126, "vegetarian": 1127, "double": 1128, "49": 1129, "efes": 1130, "indeed": 1131, "zizzi": 1132, "thought": 1133, "cb11ly": 1134, "05:00": 1135, "river": 1136, "being": 1137, "german": 1138, "water": 1139, "begin": 1140, "202": 1141, "issue": 1142, "fact": 1143, "peking": 1144, "christi": 1145, "82": 1146, "whale": 1147, "chose": 1148, "never": 1149, "curry prince": 1150, "takeaway": 1151, "corpus": 1152, "length": 1153, "17.90": 1154, "9:45": 1155, "friend": 1156, "sock": 1157, "unavailable": 1158, "32": 1159, "10:07": 1160, "directions": 1161, "38": 1162, "astroturf": 1163, "meant": 1164, "emmanuel": 1165, "flexible": 1166, "spot": 1167, "9:00": 1168, "establishment": 1169, "pitch": 1170, "theaters": 1171, "gilbert": 1172, "pound": 1173, "danish": 1174, "sleeperz": 1175, "fyne": 1176, "18:07": 1177, "01223334900": 1178, "verify": 1179, "kambar": 1180, "punter": 1181, "byard art": 1182, "glad": 1183, "believe": 1184, "apologies": 1185, "spend": 1186, "saigon": 1187, "upscale": 1188, "even": 1189, "exact": 1190, "eating": 1191, "reviews": 1192, "75.10": 1193, "science": 1194, "addresses": 1195, "appears": 1196, "desired": 1197, "injured": 1198, "amount": 1199, "family": 1200, "mid": 1201, "almost": 1202, "carolina bed and breakfast": 1203, "accident": 1204, "swiss": 1205, "cuban": 1206, "fez": 1207, "steakhouse": 1208, "74": 1209, "8:45": 1210, "wagamama": 1211, "acceptable": 1212, "through": 1213, "unusual": 1214, "alpha milton guest house": 1215, "seoul": 1216, "learner": 1217, "12:07": 1218, "shop": 1219, "133": 1220, "city centre north bed and breakfast": 1221, "you've": 1222, "taking": 1223, "haven't": 1224, "loch": 1225, "stations": 1226, "52": 1227, "50": 1228, "norfolk": 1229, "dates": 1230, "midsummer": 1231, "bill": 1232, "kirkwood": 1233, "105": 1234, "01223314960": 1235, "special": 1236, "j": 1237, "golden wok": 1238, "cb58bs": 1239, "4.40": 1240, "westside": 1241, "select": 1242, "standard": 1243, "frankie": 1244, "adress": 1245, "01223245151": 1246, "always": 1247, "hotpot": 1248, "craving": 1249, "because": 1250, "checked": 1251, "panahar": 1252, "m": 1253, "multiple sports": 1254, "arrange": 1255, "confirmed": 1256, "russian": 1257, "tables": 1258, "30": 1259, "cb21sj": 1260, "particularly": 1261, "da vinci pizzeria": 1262, "eastern": 1263, "milton country park": 1264, "nope": 1265, "punting": 1266, "backstreet": 1267, "17.60": 1268, "01223452587": 1269, "helping": 1270, "pizza hut fenditton": 1271, "coldham": 1272, "hope": 1273, "avenue": 1274, "downtown": 1275, "wine": 1276, "indonesian": 1277, "john": 1278, "it'll": 1279, "less": 1280, "greek": 1281, "causeway": 1282, "narrows": 1283, "vue cinema": 1284, "copper": 1285, "stop": 1286, "jubilee": 1287, "cookhouse": 1288, "stick": 1289, "coffee": 1290, "caribbean": 1291, "shorten": 1292, "crossover": 1293, "held": 1294, "activity": 1295, "47": 1296, "mahal": 1297, "junction": 1298, "passenger": 1299, "helpful": 1300, "huntington": 1301, "gourmet": 1302, "purchase": 1303, "37.80": 1304, "12.80": 1305, "object": 1306, "sheep": 1307, "burger": 1308, "cow": 1309, "two": 1310, "robbed": 1311, "late": 1312, "8:00": 1313, "60": 1314, "halls": 1315, "etc": 1316, "dojo noodle bar": 1317, "cambridge artworks": 1318, "scudamores": 1319, "storey": 1320, "mention": 1321, "fancy": 1322, "cheapest": 1323, "queens": 1324, "thanh binh": 1325, "ref": 1326, "takes": 1327, "broaden": 1328, "taj": 1329, "christmas": 1330, "ruskin": 1331, "general": 1332, "bennys": 1333, "land": 1334, "database": 1335, "wow": 1336, "enough": 1337, "ideas": 1338, "classical": 1339, "cb43ax": 1340, "suitable": 1341, "suppose": 1342, "old schools": 1343, "riverboat georgina": 1344, "yippee noodle bar": 1345, "concerned": 1346, "that'll": 1347, "bateman": 1348, "sri": 1349, "bangkok city": 1350, "cb11jg": 1351, "caffe": 1352, "australian": 1353, "personally": 1354, "based": 1355, "cb58as": 1356, "16:07": 1357, "asked": 1358, "persian": 1359, "charlie chan": 1360, "amazing": 1361, "chance": 1362, "13:17": 1363, "hungarian": 1364, "20:07": 1365, "lovell lodge": 1366, "along": 1367, "polish": 1368, "names": 1369, "archaelogy": 1370, "venetian": 1371, "whitehill": 1372, "actual": 1373, "the man on the moon": 1374, "royal spice": 1375, "sala": 1376, "69": 1377, "cb30aq": 1378, "frame": 1379, "affordable": 1380, "irish": 1381, "cb13ef": 1382, "leverton house": 1383, "parkside pools": 1384, "meze": 1385, "tuscan": 1386, "kosher": 1387, "catalan": 1388, "specifics": 1389, "moroccan": 1390, "churchills college": 1391, "yu garden": 1392, "517a": 1393, "put": 1394, "possibilities": 1395, "cab": 1396, "tang": 1397, "considered": 1398, "transportation": 1399, "mutliple": 1400, "query": 1401, "ah": 1402, "closer": 1403, "neither": 1404, "alone": 1405, "under": 1406, "ill": 1407, "scottish": 1408, "17:29": 1409, "travellers": 1410, "cafe jello gallery": 1411, "grounds": 1412, "8.08": 1413, "cruisers": 1414, "pricey": 1415, "05:40": 1416, "lankan": 1417, "row": 1418, "thong": 1419, "wide": 1420, "white": 1421, "ideally": 1422, "cb30af": 1423, "whipple": 1424, "departures": 1425, "saffron": 1426, "strover": 1427, "someone": 1428, "31": 1429, "um": 1430, "3.50": 1431, "du": 1432, "vin": 1433, "cambridge university botanic gardens": 1434, "lynne": 1435, "8:15": 1436, "pipasha": 1437, "comes": 1438, "the oak bistro": 1439, "home from home": 1440, "hungry": 1441, "mistake": 1442, "01223525725": 1443, "cb18dw": 1444, "su43": 1445, "arcade": 1446, "lammas": 1447, "darrys": 1448, "club salsa": 1449, "castle galleries": 1450, "downing college": 1451, "maharajah": 1452, "whale of a time": 1453, "mercers": 1454, "fare": 1455, "swedish": 1456, "red": 1457, "southern": 1458, "quality": 1459, "wife": 1460, "doing": 1461, "cb21dq": 1462, "10:32": 1463, "05:17": 1464, "north american": 1465, "little seoul": 1466, "americas": 1467, "picking": 1468, "black": 1469, "throughout": 1470, "don": 1471, "hobson": 1472, "trainid": 1473, "cambourne": 1474, "cantonese": 1475, "latin": 1476, "5357": 1477, "eritrean": 1478, "11:29": 1479, "ugly duckling": 1480, "14:07": 1481, "staring": 1482, "ali": 1483, "queen": 1484, "11:21": 1485, "rose": 1486, "fall": 1487, "sitar": 1488, "kirkwood house": 1489, "appear": 1490, "news": 1491, "08712240240": 1492, "01223210353": 1493, "53": 1494, "23:00": 1495, "la margherita": 1496, "holy trinity church": 1497, "co": 1498, "baba": 1499, "postcodes": 1500, "trouble": 1501, "01223474144": 1502, "schedules": 1503, "gastropubs": 1504, "63": 1505, "the gardenia": 1506, "frankie and bennys": 1507, "ever": 1508, "grey": 1509, "similar": 1510, "18.88": 1511, "35": 1512, "wouldn't": 1513, "howdy": 1514, "cb12lf": 1515, "kinds": 1516, "understand": 1517, "riverside brasserie": 1518, "tandoori palace": 1519, "yellow": 1520, "01223464646": 1521, "01223304050": 1522, "404": 1523, "grande": 1524, "bad": 1525, "parts": 1526, "confused": 1527, "roseford": 1528, "antiques": 1529, "lunch": 1530, "polynesian": 1531, "creative": 1532, "foods": 1533, "106": 1534, "9.80": 1535, "cineworld cinema": 1536, "saigon city": 1537, "16.50": 1538, "13:29": 1539, "05:29": 1540, "5:52": 1541, "sites": 1542, "familiar": 1543, "feel": 1544, "plough": 1545, "anglia": 1546, "figure": 1547, "middle": 1548, "adc theatre": 1549, "la raza": 1550, "64": 1551, "greetings": 1552, "changed": 1553, "01223902168": 1554, "friends": 1555, "01223902091": 1556, "cb46az": 1557, "corsica": 1558, "16:08": 1559, "press": 1560, "cb21ab": 1561, "relatively": 1562, "accommodation": 1563, "10:01": 1564, "due": 1565, "pasquale": 1566, "cb11ps": 1567, "05:11": 1568, "01223902088": 1569, "01223334860": 1570, "funky fun house": 1571, "fitzbillies restaurant": 1572, "travellers rest": 1573, "success": 1574, "working": 1575, "15:21": 1576, "13:35": 1577, "kingfisher": 1578, "afghan": 1579, "yo": 1580, "plans": 1581, "museum of archaelogy and anthropology": 1582, "bloomsbury restaurant": 1583, "17:21": 1584, "pizza express": 1585, "abbey pool and astroturf pitch": 1586, "deal": 1587, "cb30ds": 1588, "india": 1589, "tour": 1590, "14:08": 1591, "hinchinbrook": 1592, "probably": 1593, "01223366611": 1594, "girton": 1595, "scandinavian": 1596, "dispute": 1597, "1517": 1598, "norman": 1599, "bet": 1600, "activities": 1601, "cb12de": 1602, "catharine": 1603, "extra": 1604, "weekend": 1605, "buy": 1606, "wheeler": 1607, "anymore": 1608, "fitzwilliam": 1609, "centrally": 1610, "convenient": 1611, "traditional": 1612, "wandlebury country park": 1613, "cb13js": 1614, "01223332320": 1615, "sir": 1616, "15:29": 1617, "related": 1618, "blue": 1619, "narrowed": 1620, "personal": 1621, "swim": 1622, "01223304705": 1623, "asking": 1624, "herschel": 1625, "worry": 1626, "124": 1627, "marriot": 1628, "ideal": 1629, "journey": 1630, "mowbray": 1631, "cuisines": 1632, "jinling noodle bar": 1633, "11:17": 1634, "68": 1635, "across": 1636, "08715501010": 1637, "12:08": 1638, "english": 1639, "gourmet burger kitchen": 1640, "chiquito restaurant bar": 1641, "cambridge and county folk museum": 1642, "saffron brasserie": 1643, "kid": 1644, "coldhams": 1645, "01223902112": 1646, "191": 1647, "05:21": 1648, "kindly": 1649, "bus": 1650, "fails": 1651, "sesame": 1652, "halal": 1653, "slug": 1654, "lettuce": 1655, "cb21dp": 1656, "elsewhere": 1657, "hk": 1658, "01223902158": 1659, "corpus christi": 1660, "soul tree nightclub": 1661, "provides": 1662, "attending": 1663, "01223312112": 1664, "explore": 1665, "01223355397": 1666, "nah": 1667, "hourly": 1668, "01223420060": 1669, "hong": 1670, "super": 1671, "110": 1672, "17:11": 1673, "grafton hotel restaurant": 1674, "13:39": 1675, "clowns": 1676, "cambridge contemporary art": 1677, "granta": 1678, "05:54": 1679, "57": 1680, "caius": 1681, "15:52": 1682, "22:01": 1683, "15:17": 1684, "clare hall": 1685, "la tasca": 1686, "bites": 1687, "welsh": 1688, "01223300085": 1689, "cb223ae": 1690, "wrong": 1691, "anyway": 1692, "exhibition": 1693, "the missing sock": 1694, "710": 1695, "starts": 1696, "cb23qf": 1697, "concern": 1698, "96": 1699, "barton": 1700, "quick": 1701, "01954781018": 1702, "01223866800": 1703, "tried": 1704, "5:40": 1705, "cb23dz": 1706, "peas": 1707, "lion": 1708, "01223576412": 1709, "13:59": 1710, "perfectly": 1711, "11:06": 1712, "cb236bw": 1713, "05:19": 1714, "belgian": 1715, "forget": 1716, "viking": 1717, "19:35": 1718, "sleep": 1719, "5:00": 1720, "cherry hinton hall and grounds": 1721, "30.24": 1722, "went": 1723, "11:51": 1724, "grill": 1725, "cb17gx": 1726, "62": 1727, "37": 1728, "156": 1729, "preferable": 1730, "11:52": 1731, "noon": 1732, "enterprise": 1733, "worried": 1734, "australasian": 1735, "williams": 1736, "cb12tz": 1737, "the junction": 1738, "taj tandoori": 1739, "cambridge museum of technology": 1740, "the lucky star": 1741, "01223336233": 1742, "40428": 1743, "01223350914": 1744, "period": 1745, "11:32": 1746, "13:11": 1747, "silver": 1748, "delicious": 1749, "01223337766": 1750, "19:21": 1751, "5:30": 1752, "royal standard": 1753, "museum of classical archaeology": 1754, "loch fyne": 1755, "great saint marys church": 1756, "21:01": 1757, "light": 1758, "central": 1759, "example": 1760, "sidgwick": 1761, "unsure": 1762, "bummer": 1763, "various": 1764, "17:06": 1765, "meal": 1766, "known": 1767, "5:11": 1768, "18:40": 1769, "17:59": 1770, "toyota": 1771, "remember": 1772, "10.24": 1773, "concerthalls": 1774, "although": 1775, "23:29": 1776, "08451962320": 1777, "2124": 1778, "arrangements": 1779, "alternative": 1780, "cambridge chop house": 1781, "pembroke": 1782, "11:01": 1783, "the varsity restaurant": 1784, "09:29": 1785, "year": 1786, "01223333516": 1787, "cb58sx": 1788, "05:01": 1789, "01223357708": 1790, "crescent": 1791, "23:30": 1792, "gives": 1793, "83": 1794, "17:50": 1795, "portraits": 1796, "doesnt": 1797, "heidelberg": 1798, "especially": 1799, "200": 1800, "sala thong": 1801, "cambridge arts theatre": 1802, "cambridge punter": 1803, "molecular": 1804, "gastronomy": 1805, "11:35": 1806, "ring": 1807, "reasonable": 1808, "00872208000": 1809, "direct": 1810, "tenison": 1811, "unknown": 1812, "paid": 1813, "experience": 1814, "01223575314": 1815, "husband": 1816, "edward": 1817, "establishments": 1818, "square": 1819, "nandos city centre": 1820, "peking restaurant": 1821, "09:32": 1822, "cambridge lodge restaurant": 1823, "clare college": 1824, "williams art and antiques": 1825, "36": 1826, "gave": 1827, "cb12bd": 1828, "cb41er": 1829, "features": 1830, "06:07": 1831, "addition": 1832, "tesla": 1833, "given": 1834, "court": 1835, "selection": 1836, "19:29": 1837, "cb23pj": 1838, "hopefully": 1839, "northampton": 1840, "question": 1841, "pizza hut cherry hinton": 1842, "15:11": 1843, "rice boat": 1844, "the gandhi": 1845, "restuarant": 1846, "tr9448": 1847, "41": 1848, "locating": 1849, "144": 1850, "choosing": 1851, "terrace": 1852, "giving": 1853, "western": 1854, "millers": 1855, "9:52": 1856, "top": 1857, "cb39et": 1858, "13:40": 1859, "40": 1860, "reserving": 1861, "7880": 1862, "cafe uno": 1863, "kettles yard": 1864, "11:54": 1865, "restaurant 17": 1866, "the place": 1867, "13.20": 1868, "seeking": 1869, "hmmm": 1870, "cb21tt": 1871, "space": 1872, "skoda": 1873, "specified": 1874, "basque": 1875, "lexus": 1876, "felix": 1877, "whitehouse": 1878, "14.08": 1879, "tr": 1880, "trips": 1881, "11:59": 1882, "public": 1883, "p": 1884, "13:01": 1885, "backstreet bistro": 1886, "city stop restaurant": 1887, "parameters": 1888, "past": 1889, "opening": 1890, "cb21ad": 1891, "01223446104": 1892, "pe296fl": 1893, "company": 1894, "01223307402": 1895, "10:40": 1896, "10:43": 1897, "romanian": 1898, "provided": 1899, "colville": 1900, "15:27": 1901, "barbeque": 1902, "hm": 1903, "finders": 1904, "corner": 1905, "06:43": 1906, "magdalene college": 1907, "ali baba": 1908, "5:59": 1909, "rate": 1910, "expand": 1911, "5:21": 1912, "whats": 1913, "panasian": 1914, "worked": 1915, "138": 1916, "jedburgh": 1917, "01223365664": 1918, "01223336265": 1919, "singaporean": 1920, "7:17": 1921, "cb23nz": 1922, "shanghai": 1923, "13:27": 1924, "dozens": 1925, "settle": 1926, "spots": 1927, "copper kettle": 1928, "cow pizza kitchen and bar": 1929, "stazione restaurant and coffee bar": 1930, "kings college": 1931, "zizzi cambridge": 1932, "328a": 1933, "stated": 1934, "clubs": 1935, "accept": 1936, "ford": 1937, "15:39": 1938, "10.1": 1939, "depending": 1940, "cant": 1941, "cancel": 1942, "eatery": 1943, "g6": 1944, "7:15": 1945, "jesus green outdoor pool": 1946, "21:29": 1947, "05:35": 1948, "13:52": 1949, "restaurant 2 two": 1950, "honda": 1951, "01223332360": 1952, "lower": 1953, "appointment": 1954, "own": 1955, "cb21rh": 1956, "tr8842": 1957, "18:01": 1958, "cb21en": 1959, "05:58": 1960, "emmanuel college": 1961, "de luca cucina and bar": 1962, "sussex": 1963, "15:07": 1964, "estate": 1965, "151": 1966, "cb12jb": 1967, "451": 1968, "entertaining": 1969, "01223355159": 1970, "13.28": 1971, "swimmingpools": 1972, "01223324600": 1973, "5:35": 1974, "14:01": 1975, "michaelhouse": 1976, "34": 1977, "charges": 1978, "cherry hinton water play": 1979, "mumford theatre": 1980, "cherry hinton village centre": 1981, "hughes": 1982, "19:27": 1983, "saint johns chop house": 1984, "form": 1985, "thornton": 1986, "7.84": 1987, "main": 1988, "information:booking": 1989, "perne": 1990, "16:40": 1991, "eastside": 1992, "23:40": 1993, "365": 1994, "9:21": 1995, "golden curry": 1996, "sitar tandoori": 1997, "famous": 1998, "01223243830": 1999, "except": 2000, "cb23pq": 2001, "40210": 2002, "01223335511": 2003, "13:21": 2004, "10:58": 2005, "bmw": 2006, "15:01": 2007, "gueshouse": 2008, "t": 2009, "13:54": 2010, "golden house": 2011, "09:54": 2012, "09:59": 2013, "world": 2014, "lan": 2015, "rice house": 2016, "40270": 2017, "cb23hg": 2018, "22:11": 2019, "1416": 2020, "cb58ld": 2021, "5:17": 2022, "01954714600": 2023, "11:24": 2024, "facilities": 2025, "205": 2026, "1519": 2027, "cb11pt": 2028, "favorites": 2029, "pleasure": 2030, "cb22ha": 2031, "fan": 2032, "tomorrow": 2033, "towards": 2034, "midsummer house restaurant": 2035, "kings hedges learner pool": 2036, "darrys cookhouse and wine shop": 2037, "j restaurant": 2038, "trinity college": 2039, "gog": 2040, "magog": 2041, "babraham": 2042, "eateries": 2043, "taken": 2044, "towninfo": 2045, "higher": 2046, "10:10": 2047, "depends": 2048, "cb41jy": 2049, "suits": 2050, "251a": 2051, "scheduled": 2052, "cb23na": 2053, "away": 2054, "bookings": 2055, "60.08": 2056, "cb21su": 2057, "nando": 2058, "appeal": 2059, "optional": 2060, "la mimosa": 2061, "13:51": 2062, "17:58": 2063, "scott": 2064, "polar": 2065, "hilton": 2066, "290": 2067, "01223295264": 2068, "darn": 2069, "openings": 2070, "audi": 2071, "05:32": 2072, "2g": 2073, "01223353248": 2074, "calling": 2075, "shopping": 2076, "pulled": 2077, "01223842725": 2078, "decent": 2079, "vere": 2080, "falls": 2081, "01223324222": 2082, "16:36": 2083, "options:": 2084, "whipple museum of the history of science": 2085, "queens college": 2086, "the fez club": 2087, "05:30": 2088, "7:29": 2089, "15:35": 2090, "they'll": 2091, "5:15": 2092, "01223354382": 2093, "wants": 2094, "06:08": 2095, "17:39": 2096, "19:07": 2097, "01223519224": 2098, "adjust": 2099, "01223367660": 2100, "plaza": 2101, "cb21qy": 2102, "01223304906": 2103, "11:11": 2104, "pulling": 2105, "response": 2106, "int": 2107, "clear": 2108, "tandoor": 2109, "09:50": 2110, "15:50": 2111, "canapes": 2112, "attend": 2113, "industrial": 2114, "cb58hy": 2115, "19:09": 2116, "19:50": 2117, "21:40": 2118, "resturant": 2119, "sturton": 2120, "214": 2121, "12:01": 2122, "decide": 2123, "12:21": 2124, "108": 2125, "01223332138": 2126, "10:11": 2127, "luxury": 2128, "01223333200": 2129, "sights": 2130, "homerton": 2131, "barbecue": 2132, "9:01": 2133, "tr7966": 2134, "3.52": 2135, "01223364222": 2136, "15:24": 2137, "08:09": 2138, "zealand": 2139, "09:39": 2140, "efes restaurant": 2141, "14.32": 2142, "01223518111": 2143, "17:54": 2144, "12:09": 2145, "01223355017": 2146, "11:27": 2147, "01223312843": 2148, "cb12dp": 2149, "she": 2150, "09:01": 2151, "uh": 2152, "gathering": 2153, "sport": 2154, "required": 2155, "visitors": 2156, "eclectic": 2157, "tr5219": 2158, "cb21tl": 2159, "confusing": 2160, "01223566188": 2161, "15:58": 2162, "cb23rh": 2163, "2,828": 2164, "served": 2165, "20:24": 2166, "fifteen": 2167, "cb17sr": 2168, "appealing": 2169, "18:24": 2170, "treat": 2171, "restaurant alimentum": 2172, "global": 2173, "05:15": 2174, "17:40": 2175, "23:35": 2176, "thirteen": 2177, "19:17": 2178, "retail": 2179, "cb30ad": 2180, "01480446000": 2181, "driver": 2182, "cb43px": 2183, "bored": 2184, "09:21": 2185, "17.6": 2186, "alternate": 2187, "05:45": 2188, "operation": 2189, "thankyou": 2190, "5:29": 2191, "09:09": 2192, "telling": 2193, "11:16": 2194, "75.09": 2195, "historical": 2196, "otherwise": 2197, "insanely": 2198, "single": 2199, "cb58rs": 2200, "month": 2201, "cb21uf": 2202, "cb19ej": 2203, "meze bar": 2204, "fitzwilliam museum": 2205, "01223323737": 2206, "save": 2207, "reasonably": 2208, "c": 2209, "cb21jf": 2210, "regretfully": 2211, "decided": 2212, "misspoke": 2213, "01223566388": 2214, "volvo": 2215, "move": 2216, "proper": 2217, "9:09": 2218, "01223368650": 2219, "big": 2220, "talk": 2221, "crowne": 2222, "complimentary": 2223, "80": 2224, "stayed": 2225, "lookup": 2226, "01223302330": 2227, "child": 2228, "narrowing": 2229, "learn": 2230, "sadly": 2231, "04:00": 2232, "india house": 2233, "pipasha restaurant": 2234, "cb21st": 2235, "24:45": 2236, "following": 2237, "152": 2238, "stuff": 2239, "helps": 2240, "l": 2241, "07782218745": 2242, "cb23bj": 2243, "afford": 2244, "offered": 2245, "cb21eg": 2246, "services": 2247, "84": 2248, "saying": 2249, "14:58": 2250, "16:11": 2251, "fairly": 2252, "17:55": 2253, "live": 2254, "walking": 2255, "computer": 2256, "anyone": 2257, "final": 2258, "who": 2259, "22:00": 2260, "result": 2261, "doubletree": 2262, "volkswagen": 2263, "18:32": 2264, "17:01": 2265, "stevanage": 2266, "arrived": 2267, "19:59": 2268, "closed": 2269, "16:01": 2270, "came": 2271, "pumping": 2272, "cheddars": 2273, "drive": 2274, "01223277977": 2275, "13:58": 2276, "01223338000": 2277, "passengers": 2278, "08:23": 2279, "fro": 2280, "ot": 2281, "12:40": 2282, "10:08": 2283, "172": 2284, "01223352607": 2285, "01223511511": 2286, "worries": 2287, "stanford": 2288, "19:11": 2289, "16:32": 2290, "lynne strover gallery": 2291, "email": 2292, "easy": 2293, "12:24": 2294, "01223327978": 2295, "everyone": 2296, "5:01": 2297, "09:52": 2298, "tr5767": 2299, "add": 2300, "expecting": 2301, "01223351707": 2302, "town:": 2303, "17:27": 2304, "01223276653": 2305, "5:09": 2306, "cb238el": 2307, "finish": 2308, "previously": 2309, "23:39": 2310, "20:08": 2311, "17:35": 2312, "01223503333": 2313, "6:07": 2314, "hot": 2315, "01223512596": 2316, "front": 2317, "disappointing": 2318, "cb41as": 2319, "cambride": 2320, "01223477900": 2321, "152154": 2322, "the river bar steakhouse and grill": 2323, "clowns cafe": 2324, "18:21": 2325, "pizza hut city centre": 2326, "curious": 2327, "50.5": 2328, "01223240089": 2329, "cb41eh": 2330, "cb30nd": 2331, "darry": 2332, "g4": 2333, "shortly": 2334, "169": 2335, "events": 2336, "cb23ar": 2337, "math": 2338, "modify": 2339, "10:09": 2340, "05:39": 2341, "9:07": 2342, "01223359750": 2343, "14:09": 2344, "experiencing": 2345, "15:36": 2346, "17:32": 2347, "11:58": 2348, "19:01": 2349, "standsted": 2350, "drop": 2351, "chesteron": 2352, "low": 2353, "music": 2354, "southend": 2355, "cb41xa": 2356, "good luck": 2357, "scott polar museum": 2358, "19:58": 2359, "08:07": 2360, "13:32": 2361, "07:00": 2362, "sesame restaurant and bar": 2363, "sight": 2364, "assume": 2365, "01223335153": 2366, "12:52": 2367, "01223315702": 2368, "miss": 2369, "brazilian": 2370, "whole": 2371, "tr0927": 2372, "16:09": 2373, "12:06": 2374, "21:21": 2375, "opinion": 2376, "tons": 2377, "09:35": 2378, "01223366202": 2379, "yea": 2380, "19:51": 2381, "distance": 2382, "16.6": 2383, "11:40": 2384, "large": 2385, "exists": 2386, "23:01": 2387, "cambrdige": 2388, "cb42je": 2389, "suffice": 2390, "aylesbury": 2391, "01223362372": 2392, "unless": 2393, "constraint": 2394, "job": 2395, "saint johns college": 2396, "tang chinese": 2397, "maharajah tandoori restaurant": 2398, "sidney sussex college": 2399, "shanghai family restaurant": 2400, "12:32": 2401, "15:06": 2402, "19:40": 2403, "16:58": 2404, "11:36": 2405, "terms": 2406, "732734": 2407, "answer": 2408, "15:40": 2409, "supposed": 2410, "12.8": 2411, "10:24": 2412, "contacting": 2413, "9:39": 2414, "approximately": 2415, "05:24": 2416, "4753": 2417, "6:30": 2418, "01223350688": 2419, "deciding": 2420, "01223302579": 2421, "regardless": 2422, "print": 2423, "chosen": 2424, "cb12as": 2425, "09:16": 2426, "15:54": 2427, "10:55": 2428, "destinations": 2429, "campus": 2430, "14:23": 2431, "th": 2432, "17:51": 2433, "15:16": 2434, "starving": 2435, "5:36": 2436, "hard": 2437, "01223368786": 2438, "11:39": 2439, "01223311625": 2440, "lan hong house": 2441, "sheeps green and lammas land park fen causeway": 2442, "14:43": 2443, "curry king": 2444, "20:23": 2445, "12:55": 2446, "tr2083": 2447, "3334": 2448, "529": 2449, "unique": 2450, "grab": 2451, "neat": 2452, "18:10": 2453, "appeals": 2454, "01223327908": 2455, "dear": 2456, "involving": 2457, "movie": 2458, "02:15": 2459, "placed": 2460, "hurt": 2461, "shows": 2462, "silly": 2463, "13:24": 2464, "directly": 2465, "left": 2466, "steakhouses": 2467, "pricier": 2468, "points": 2469, "09:06": 2470, "cb58nt": 2471, "17:16": 2472, "saint catharines college": 2473, "emergency": 2474, "don pasquale pizzeria": 2475, "the hotpot": 2476, "11:09": 2477, "attention": 2478, "19:52": 2479, "bunch": 2480, "hate": 2481, "06:10": 2482, "tr4748": 2483, "cb43le": 2484, "ref#": 2485, "01223412299": 2486, "01223363471": 2487, "7:11": 2488, "size": 2489, "state": 2490, "cb42xh": 2491, "tr5154": 2492, "cb23qb": 2493, "reachable": 2494, "cb23ap": 2495, "6:08": 2496, "avoid": 2497, "22:08": 2498, "liking": 2499, "cb21db": 2500, "19:06": 2501, "operating": 2502, "cb23hx": 2503, "desk": 2504, "cb21ta": 2505, "respectively": 2506, "dale": 2507, "brewery": 2508, "66": 2509, "prefered": 2510, "01223338400": 2511, "buildings": 2512, "itinerary": 2513, "restaraunt": 2514, "07:29": 2515, "mine": 2516, "drinks": 2517, "that'd": 2518, "hotel du vin and bistro": 2519, "the slug and lettuce": 2520, "pembroke college": 2521, "07:15": 2522, "10:54": 2523, "tea": 2524, "little saint marys church": 2525, "cambridge book and print gallery": 2526, "peoples portraits exhibition at girton college": 2527, "gonville and caius college": 2528, "8:07": 2529, "01223351241": 2530, "01223247877": 2531, "expect": 2532, "you:": 2533, "12:38": 2534, "yummy": 2535, "18:58": 2536, "tr9859": 2537, "looked": 2538, "heart": 2539, "centre:": 2540, "happens": 2541, "providing": 2542, "21:59": 2543, "01223323361": 2544, "01223812660": 2545, "5:16": 2546, "01223362456": 2547, "01223361763": 2548, "above": 2549, "7:00": 2550, "lasting": 2551, "met": 2552, "10:35": 2553, "01223352500": 2554, "londons": 2555, "outside": 2556, "soonest": 2557, "cb21tq": 2558, "paying": 2559, "gwydir": 2560, "cb12lj": 2561, "cb13nf": 2562, "196": 2563, "numerous": 2564, "07:21": 2565, "151.19": 2566, "07:07": 2567, "movies": 2568, "qualifications": 2569, "event": 2570, "dishes": 2571, "yourself": 2572, "cetre": 2573, "cb23jx": 2574, "honestly": 2575, "scudamores punting co": 2576, "regency": 2577, "05:16": 2578, "gallery at 12 a high street": 2579, "plus": 2580, "tight": 2581, "12:43": 2582, "toward": 2583, "tr0254": 2584, "18:11": 2585, "inquiry": 2586, "mistaken": 2587, "odd": 2588, "pull": 2589, "started": 2590, "sooner": 2591, "23:11": 2592, "01223748100": 2593, "mainly": 2594, "took": 2595, "cb58pa": 2596, "6:45": 2597, "17:07": 2598, "reputation": 2599, "restraunt": 2600, "mins": 2601, "gotten": 2602, "guestroom": 2603, "vary": 2604, "bout": 2605, "06:15": 2606, "matters": 2607, "cb23hu": 2608, "tr6742": 2609, "football": 2610, "01223311911": 2611, "impress": 2612, "14:40": 2613, "small": 2614, "72": 2615, "23:17": 2616, "21:36": 2617, "advance": 2618, "89.5": 2619, "appropriate": 2620, "tr5348": 2621, "level": 2622, "tr6838": 2623, "01223244149": 2624, "hundred": 2625, "tr7047": 2626, "tr6524": 2627, "friendly": 2628, "hk fusion": 2629, "sufficient": 2630, "cb13nl": 2631, "owe": 2632, "01:30": 2633, "read": 2634, "01223338300": 2635, "01223506055": 2636, "changing": 2637, "21:39": 2638, "cb39ey": 2639, "08:58": 2640, "categories": 2641, "daily": 2642, "connect": 2643, "14:24": 2644, "among": 2645, "tr2515": 2646, "7:52": 2647, "makes": 2648, "139": 2649, "cb30ag": 2650, "tr2715": 2651, "20:32": 2652, "exciting": 2653, "are:": 2654, "address:": 2655, "hotspot": 2656, "bye": 2657, "1,414": 2658, "05:36": 2659, "cb11eg": 2660, "cb23pp": 2661, "completely": 2662, "runs": 2663, "3:15": 2664, "cb21rb": 2665, "huh": 2666, "14:32": 2667, "16:55": 2668, "17:17": 2669, "07807718591": 2670, "cb43hl": 2671, "06:30": 2672, "01223302010": 2673, "01223248882": 2674, "tr8494": 2675, "tourists": 2676, "6:55": 2677, "183": 2678, "01223334200": 2679, "remembered": 2680, "01223244277": 2681, "cb23ll": 2682, "01223350059": 2683, "18:36": 2684, "19:55": 2685, "14:11": 2686, "01223362433": 2687, "spread": 2688, "truly": 2689, "reference:": 2690, "4:15": 2691, "7:27": 2692, "15:59": 2693, "taste": 2694, "postcode:": 2695, "o": 2696, "bring": 2697, "12:11": 2698, "cb21uj": 2699, "cb43ht": 2700, "07:52": 2701, "tr2987": 2702, "18:08": 2703, "01223329432": 2704, "current": 2705, "rates": 2706, "13.2": 2707, "71.59": 2708, "tr8464": 2709, "01223332400": 2710, "5:24": 2711, "46": 2712, "luncheon": 2713, "previous": 2714, "recheck": 2715, "board": 2716, "04:45": 2717, "available:": 2718, "necessity": 2719, "handle": 2720, "half": 2721, "occasion": 2722, "historic": 2723, "5:32": 2724, "fair": 2725, "06:09": 2726, "06:45": 2727, "20:01": 2728, "ian": 2729, "03:45": 2730, "13:06": 2731, "20:21": 2732, "11:07": 2733, "surprisingly": 2734, "231": 2735, "cb11ee": 2736, "tr1163": 2737, "matched": 2738, "longer": 2739, "13:09": 2740, "break": 2741, "17.89": 2742, "ooh": 2743, "region": 2744, "cities": 2745, "congratulations": 2746, "23:21": 2747, "01223505015": 2748, "9:17": 2749, "14:10": 2750, "05:59": 2751, "02:45": 2752, "tr3225": 2753, "exist": 2754, "cb39al": 2755, "9:29": 2756, "potential": 2757, "30.29": 2758, "01223324033": 2759, "21:35": 2760, "n": 2761, "cb39lh": 2762, "cb21tw": 2763, "riding": 2764, "22:40": 2765, "thompsons": 2766, "oops": 2767, "10:16": 2768, "21:50": 2769, "trick": 2770, "16:24": 2771, "whenever": 2772, "chines": 2773, "discussed": 2774, "wollaston": 2775, "01223334898": 2776, "01223412430": 2777, "commuting": 2778, "52.8": 2779, "themed": 2780, "8:43": 2781, "cb12qa": 2782, "16:06": 2783, "speak": 2784, "persons": 2785, "d": 2786, "hogwarts": 2787, "tr6009": 2788, "18:52": 2789, "adults": 2790, "the cambridge corn exchange": 2791, "02:00": 2792, "stratford": 2793, "medicine": 2794, "wise": 2795, "real": 2796, "5:50": 2797, "01223331100": 2798, "tr1499": 2799, "daughter": 2800, "wished": 2801, "14:54": 2802, "fir": 2803, "12:58": 2804, "driving": 2805, "lasts": 2806, "19:08": 2807, "accomodations": 2808, "tr6003": 2809, "bishop": 2810, "40.4": 2811, "pasta": 2812, "menu": 2813, "tr7733": 2814, "tr1492": 2815, "01223338800": 2816, "tr8903": 2817, "01223227330": 2818, "nevermind": 2819, "michael": 2820, "20:11": 2821, "9:54": 2822, "sweet": 2823, "cb17aa": 2824, "egg": 2825, "rolls": 2826, "highest": 2827, "20:55": 2828, "5:54": 2829, "spending": 2830, "cb43pe": 2831, "16:10": 2832, "assuming": 2833, "07:19": 2834, "surrounding": 2835, "brassiere": 2836, "sells": 2837, "true": 2838, "liek": 2839, "06:00": 2840, "cambidge": 2841, "michaelhouse cafe": 2842, "facility": 2843, "tr9561": 2844, "35.2": 2845, "8:08": 2846, "12:10": 2847, "06:32": 2848, "quickly": 2849, "tr2166": 2850, "15:32": 2851, "flying": 2852, "tax": 2853, "fully": 2854, "9.8": 2855, "01223364319": 2856, "11:55": 2857, "05:09": 2858, "12:23": 2859, "wherever": 2860, "cutting": 2861, "nicer": 2862, "cb12az": 2863, "future": 2864, "17:08": 2865, "bell": 2866, "11:50": 2867, "postalcode": 2868, "information:": 2869, "burleigh": 2870, "cb41uy": 2871, "area:": 2872, "towns": 2873, "petersborough": 2874, "considering": 2875, "slots": 2876, "tr5729": 2877, "tr9937": 2878, "mall": 2879, "mixed": 2880, "sorts": 2881, "riders": 2882, "59": 2883, "feeling": 2884, "01223575122": 2885, "tr1502": 2886, "tr3112": 2887, "elegant": 2888, "saint barnabas press gallery": 2889, "05:50": 2890, "01842753771": 2891, "25": 2892, "suggested": 2893, "complex": 2894, "21:54": 2895, "619": 2896, "01223259988": 2897, "01223241387": 2898, "create": 2899, "her": 2900, "stafford": 2901, "18:35": 2902, "08:40": 2903, "repeat": 2904, "specifying": 2905, "anniversary": 2906, "tr5015": 2907, "tr8860": 2908, "aid": 2909, "11:44": 2910, "01223353071": 2911, "eriterean": 2912, "01:27": 2913, "short": 2914, "two:": 2915, "01223363682": 2916, "three:": 2917, "01223357851": 2918, "8:24": 2919, "07:30": 2920, "kill": 2921, "joint": 2922, "07:06": 2923, "fascinating": 2924, "7:54": 2925, "difference": 2926, "cb30lx": 2927, "01223462354": 2928, "dig": 2929, "01223217118": 2930, "12:34": 2931, "bite": 2932, "southside": 2933, "01223362525": 2934, "mostly": 2935, "10:34": 2936, "15:09": 2937, "13:07": 2938, "01223247942": 2939, "hughes hall": 2940, "19:54": 2941, "07:45": 2942, "ago": 2943, "gueshouses": 2944, "01223338600": 2945, "terribly": 2946, "server": 2947, "precise": 2948, "online": 2949, "joining": 2950, "allenball": 2951, "entertainments": 2952, "watch": 2953, "9:35": 2954, "trust": 2955, "ending": 2956, "northside": 2957, "cb23nj": 2958, "guestrooms": 2959, "08719429180": 2960, "favourite": 2961, "21:17": 2962, "39": 2963, "01223727410": 2964, "extremely": 2965, "7:21": 2966, "99": 2967, "sometimes": 2968, "cb21aw": 2969, "tr2045": 2970, "process": 2971, "tr6688": 2972, "confuse": 2973, "ave": 2974, "01223302580": 2975, "varying": 2976, "situated": 2977, "knew": 2978, "common": 2979, "1:15": 2980, "usually": 2981, "clients": 2982, "inquire": 2983, "message": 2984, "archeology": 2985, "22:45": 2986, "reccomendation": 2987, "tr5921": 2988, "weeks": 2989, "tr1581": 2990, "01223448620": 2991, "16:48": 2992, "ruskin gallery": 2993, "21:11": 2994, "medical": 2995, "07:17": 2996, "07:35": 2997, 